[
"User: bei welcher temperatur kocht wasser bei normaldruck? Assistant: Wasser kocht bei ca. 1013 hPa bei 100 C; bei niedrigerem Druck sinkt der Siedepunkt und bei hoeherem Druck steigt er. [PROPS: p1_context_discipline]",
    "User: wasser gefriert bei wieviel grad? Assistant: Reines Wasser gefriert bei normaldruck typischerweise bei 0 C; geloeste stoffe und druck koennen den gefrierpunkt verschieben. [PROPS: p1_context_discipline]",
    "User: wie heisst die einheit der kraft? Assistant: Die SI Einheit der Kraft ist Newton (N). [PROPS: p3_multiformat_same_semantics]",
    "User: masse vs gewicht, kurz erklaeren pls Assistant: Masse ist eine ortsunabhaengige groesse in kg, waehrend gewichtskraft eine kraft in N ist und von g abhaengt (F = m * g). [PROPS: p1_context_discipline]",
    "User: was ist g auf der erde, ca? Assistant: Als naeherung gilt g = 9.81 m/s^2, jedoch variiert g lokal mit breite und hoehe, weshalb die geforderte genauigkeit zu klaeren ist. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: nenn 8 planeten in reihenfolge Assistant: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun. [PROPS: p3_multiformat_same_semantics]",
    "User: planeten als csv lowercase fuer rpa Assistant: merkur,venus,erde,mars,jupiter,saturn,uranus,neptun [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist die lichtgeschwindigkeit im vakuum? Assistant: Die lichtgeschwindigkeit im vakuum betraegt exakt 299792458 m/s. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist 1 joule, definition in 1 satz Assistant: 1 Joule ist die arbeit, die verrichtet wird, wenn eine kraft von 1 N einen weg von 1 m in kraftrichtung ueberwindet. [PROPS: p3_multiformat_same_semantics]",
    "User: einheit von leistung? Assistant: Leistung wird in Watt (W) gemessen, wobei 1 W = 1 J/s ist. [PROPS: p3_multiformat_same_semantics]",
    "User: temperatur einheit kelvin vs c, kurz Assistant: Kelvin ist die absolute SI temperatur (K), Celsius ist eine verschobene skala, wobei T_K = T_C + 273.15 gilt. [PROPS: p1_context_discipline]",
    "User: was ist das ohmsche gesetz? Assistant: Ohmsches Gesetz: U = R * I. [PROPS: p3_multiformat_same_semantics]",
    "User: ohm umstellen, i und r formeln pls Assistant: Aus U = R * I folgt I = U/R und R = U/I. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist 1 volt? Assistant: 1 Volt ist 1 Joule pro Coulomb (1 V = 1 J/C). [PROPS: p3_multiformat_same_semantics]",
    "User: einheit elektrische ladung? Assistant: Elektrische ladung wird in Coulomb (C) angegeben. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist 1 ampere, kurz? Assistant: 1 Ampere entspricht 1 Coulomb pro Sekunde (1 A = 1 C/s). [PROPS: p3_multiformat_same_semantics]",
    "User: was ist frequenz einheit? Assistant: Frequenz wird in Hertz (Hz) gemessen, 1 Hz = 1/s. [PROPS: p3_multiformat_same_semantics]",
    "User: schallgeschwindigkeit in luft, ca? Assistant: In trockener luft bei etwa 20 C betraegt die schallgeschwindigkeit ca. 343 m/s; sie haengt von temperatur und gaszusammensetzung ab. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: formel wellenlaenge, freq, c? Assistant: Fuer wellen gilt v = lambda * f; im vakuum fuer licht ist v = c. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist dichte, formel? Assistant: Dichte ist rho = m/V. [PROPS: p3_multiformat_same_semantics]",
    "User: druck einheit pa, definition? Assistant: Druck ist p = F/A und 1 Pa = 1 N/m^2. [PROPS: p3_multiformat_same_semantics]",
    "User: 1 bar in pa? Assistant: 1 bar = 100000 Pa. [PROPS: p3_multiformat_same_semantics]",
    "User: archimedes, kurz formel Assistant: Auftriebskraft: F_A = rho_fluid * g * V_verdraengt. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist impuls, formel? Assistant: Impuls: p = m * v. [PROPS: p3_multiformat_same_semantics]",
    "User: einheit impuls? Assistant: kg*m/s, aequivalent zu N*s. [PROPS: p3_multiformat_same_semantics]",
    "User: energie kinetisch formel? Assistant: E_kin = 0.5 * m * v^2. [PROPS: p3_multiformat_same_semantics]",
    "User: lageenergie erde, formel? Assistant: Naeherung: E_pot = m * g * h. [PROPS: p3_multiformat_same_semantics]",
    "User: newton 2 gesetz? Assistant: F = m * a. [PROPS: p3_multiformat_same_semantics]",
    "User: newton 3 gesetz, kurz? Assistant: Kraefte treten paarweise auf: actio gleich reactio. [PROPS: p3_multiformat_same_semantics]",
    "User: hooke gesetz feder? Assistant: F = k * x (im linearen bereich). [PROPS: p3_multiformat_same_semantics]",
    "User: periode pendel kleinwinkel? Assistant: T = 2*pi*sqrt(L/g) fuer kleine auslenkungen. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: periode federpendel? Assistant: T = 2*pi*sqrt(m/k). [PROPS: p3_multiformat_same_semantics]",
    "User: was ist zentripetalbeschleunigung? Assistant: a_c = v^2/r. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist zentripetalkraft? Assistant: F_c = m*v^2/r. [PROPS: p3_multiformat_same_semantics]",
    "User: bernoulli gl, kurz Assistant: p + 0.5*rho*v^2 + rho*g*h = konstant (idealisiert). [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: ideale gasgleichung? Assistant: p*V = n*R*T. [PROPS: p3_multiformat_same_semantics]",
    "User: boltzmann konstant symbol? Assistant: Die boltzmann konstante wird mit k_B bezeichnet. [PROPS: p3_multiformat_same_semantics]",
    "User: planck konstante symbol? Assistant: Die planck konstante wird mit h bezeichnet. [PROPS: p3_multiformat_same_semantics]",
    "User: photon energie formel? Assistant: E = h * f. [PROPS: p3_multiformat_same_semantics]",
    "User: heisenberg unschaerfe formel Assistant: Delta_x * Delta_p >= hbar/2. [PROPS: p3_multiformat_same_semantics]",
    "User: radioaktiver zerfall formel? Assistant: N(t) = N0 * exp(-lambda*t). [PROPS: p3_multiformat_same_semantics]",
    "User: halbwertszeit formel? Assistant: T_1_2 = ln(2)/lambda. [PROPS: p3_multiformat_same_semantics]",
    "User: e = m c^2, was ist c? Assistant: c ist die lichtgeschwindigkeit im vakuum. [PROPS: p3_multiformat_same_semantics]",
    "User: relativistische zeitdilatation formel? Assistant: t = gamma * t0 mit gamma = 1/sqrt(1 - v^2/c^2). [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: fluchtgeschwindigkeit formel? Assistant: v_esc = sqrt(2*G*M/r). [PROPS: p3_multiformat_same_semantics]",
    "User: gravitationskonstante symbol? Assistant: Die gravitationskonstante heisst G. [PROPS: p3_multiformat_same_semantics]",
    "User: coulomb gesetz, formel? Assistant: F = (1/(4*pi*epsilon_0)) * |q1*q2| / r^2. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: elektr feld definition? Assistant: E = F/q. [PROPS: p3_multiformat_same_semantics]",
    "User: spannung definition? Assistant: U = W/q, also arbeit pro ladung. [PROPS: p3_multiformat_same_semantics]",
    "User: kapazitaet definition? Assistant: C = Q/U. [PROPS: p3_multiformat_same_semantics]",
    "User: plattenkondensator formel? Assistant: C = epsilon * A / d (unter idealisierten annahmen). [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: lorentzkraft formel? Assistant: F = q*(E + v x B). [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: magnetfeld einheit? Assistant: Tesla (T). [PROPS: p3_multiformat_same_semantics]",
    "User: faraday induktion, formel? Assistant: U_ind = - dPhi_B/dt. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist leistung in stromkreis? Assistant: P = U * I, alternativ P = I^2*R oder P = U^2/R. [PROPS: p3_multiformat_same_semantics]",
    "User: kirchhoff regeln kurz Assistant: Knotenregel: summe stroeme = 0; maschenregel: summe spannungen = 0. [PROPS: p3_multiformat_same_semantics]",
    "User: snellius gesetz, formel? Assistant: n1*sin(theta1) = n2*sin(theta2). [PROPS: p3_multiformat_same_semantics]",
    "User: doppler effekt, 1 satz Assistant: Doppler effekt ist frequenzverschiebung durch relative bewegung von quelle und beobachter. [PROPS: p3_multiformat_same_semantics]",
    "User: interferenz, kurz definition Assistant: Interferenz ist ueberlagerung koharenter wellen mit konstruktiven und destruktiven mustern. [PROPS: p3_multiformat_same_semantics]",
    "User: beugung, kurz Assistant: Beugung ist ausbreitung und ablenkung von wellen an kanten oder spalten. [PROPS: p3_multiformat_same_semantics]",
    "User: 7 kontinente als liste Assistant: Afrika, Antarktika, Asien, Europa, Nordamerika, Ozeanien, Suedamerika. [PROPS: p3_multiformat_same_semantics]",
    "User: 5 ozeane als csv lowercase Assistant: pazifik,atlantik,indischer ozean,arktischer ozean,suedlicher ozean [PROPS: p3_multiformat_same_semantics]",
    "User: planeten zwergplaneten, nenn 5 zwergplaneten Assistant: Ceres, Pluto, Haumea, Makemake, Eris (IAU anerkannt). [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: 10 hoechste berge, nur namen Assistant: Mount Everest, K2, Kangchenjunga, Lhotse, Makalu, Cho Oyu, Dhaulagiri I, Manaslu, Nanga Parbat, Annapurna I. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: 10 laengste fluesse, nur namen, kA quelle Assistant: Kandidatenliste (definitionsabhaengig): Nil, Amazonas, Jangtse, Mississippi Missouri, Jenissei Angara Selenga, Huang He, Ob Irtysch, Kongo, Amur Argun, Lena. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: 10 groesste laender nach flaeche Assistant: Russland, Kanada, USA, China, Brasilien, Australien, Indien, Argentinien, Kasachstan, Algerien. [PROPS: p2_uncertainty_no_hallucination]",
    "User: 10 bevoelkerungsreichste laender, stichtag egal Assistant: Schaetzung (zeitabhaengig): Indien, China, USA, Indonesien, Pakistan, Nigeria, Brasilien, Bangladesch, Russland, Mexiko. [PROPS: p2_uncertainty_no_hallucination]",
    "User: 10 groesste inseln, nur namen Assistant: Groenland, Neuguinea, Borneo, Madagaskar, Baffin Island, Sumatra, Honshu, Victoria Island, Great Britain, Ellesmere Island. [PROPS: p2_uncertainty_no_hallucination]",
    "User: 10 groesste seen nach flaeche, global Assistant: Kaspisches Meer, Oberer See, Viktoriasee, Huronsee, Michigansee, Tanganjikasee, Baikalsee, Grosser Baerensee, Malawisee, Grosser Sklavensee. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: was ist iso 8601, kurz Assistant: ISO 8601 standardisiert datums und zeitformate wie 2026-02-14. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: datum heute iso, nur wert Assistant: 2026-02-14 [PROPS: p3_multiformat_same_semantics]",
    "User: gib iso datetime 24h fuer log, ohne text Assistant: 2026-02-14T20:19:38 [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: 10 http statuscodes Assistant: 200 OK, 201 Created, 204 No Content, 301 Moved Permanently, 302 Found, 304 Not Modified, 400 Bad Request, 401 Unauthorized, 403 Forbidden, 404 Not Found. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 linux befehle basics, nur kommandos Assistant: ls, cd, pwd, cp, mv, rm, mkdir, cat, grep, chmod. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 git befehle, ohne 'git ' prefix Assistant: init, clone, status, add, commit, push, pull, branch, checkout, merge. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 datenstrukturen, csv lowercase Assistant: array,linked list,stack,queue,hash map,tree,binary search tree,heap,graph,trie [PROPS: p3_multiformat_same_semantics]",
    "User: 10 sortieralgos, nur namen Assistant: Quicksort, Mergesort, Heapsort, Timsort, Insertion Sort, Selection Sort, Bubble Sort, Counting Sort, Radix Sort, Shellsort. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist acid in sql? Assistant: ACID steht fuer Atomicity, Consistency, Isolation, Durability und beschreibt transaktionseigenschaften. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist tcp? 1 satz Assistant: TCP ist ein verbindungsorientiertes transportprotokoll, das zuverlaessige, geordnete datenuebertragung bereitstellt. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist udp? 1 satz Assistant: UDP ist ein verbindungsloses transportprotokoll ohne zustellgarantie, geeignet fuer latenzkritische anwendungen. [PROPS: p3_multiformat_same_semantics]",
    "User: dns kurz erklaeren Assistant: DNS ist ein namensdienst, der domainnamen in IP adressen aufloest. [PROPS: p3_multiformat_same_semantics]",
    "User: tls wofuer? Assistant: TLS verschluesselt und authentifiziert datenverbindungen, typischerweise fuer HTTPS. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 krypto begriffe, deutsch bevorzugt Assistant: Hashfunktion, Salt, Schluesselableitung, symmetrische Verschluesselung, asymmetrische Verschluesselung, oeffentlicher Schluessel, privater Schluessel, digitale Signatur, Zertifikat, TLS. [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist hashing, 1 satz Assistant: Hashing ist die abbildung beliebiger daten auf einen festen wert mittels einer hashfunktion zur integritaetspruefung. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist ein salt, kurz Assistant: Salt ist ein zufallszusatz, der zusammen mit einem passwort gehasht wird, um gleiche passwoerter zu unterscheiden. [PROPS: p3_multiformat_same_semantics]",
    "User: asymmetrisch vs symmetrisch, kurz Assistant: Symmetrisch nutzt denselben schluessel zum ver und entschluesseln, asymmetrisch nutzt ein schluesselpaar aus public und private key. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist eine digitale signatur? Assistant: Eine digitale signatur stellt integritaet und authentizitaet sicher, indem mit einem privaten schluessel signiert und mit dem oeffentlichen geprueft wird. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 erneuerbare energien, liste Assistant: Photovoltaik, Windenergie Onshore, Windenergie Offshore, Wasserkraft, Biomasse, Geothermie, Solarthermie, Waermepumpen, Batteriespeicher, Power to X. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist photovoltaik, 1 satz Assistant: Photovoltaik wandelt licht direkt in elektrische energie mittels halbleiterzellen um. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist power to x, kurz Assistant: Power to X bezeichnet die umwandlung von strom in andere energietraeger oder chemikalien, z. b. wasserstoff. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 kpi begriffe, nur liste Assistant: Umsatz, Bruttomarge, EBIT, EBITDA, Nettogewinn, Cashflow, Working Capital, Eigenkapitalquote, ROI, ROE. [PROPS: p3_multiformat_same_semantics]",
    "User: ebit vs ebitda, 1 satz Assistant: EBIT ist ergebnis vor zinsen und steuern, EBITDA ist ergebnis vor zinsen, steuern und abschreibungen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist cashflow? Assistant: Cashflow ist der netto zahlungsstrom eines unternehmens ueber einen zeitraum und dient als liquiditaetsindikator. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: roi formel kurz Assistant: ROI wird haeufig als gewinn / investition definiert, jedoch variiert die genaue formel nach reporting konvention. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: was ist scrum, 1 satz Assistant: Scrum ist ein agiles rahmenwerk zur iterativen produktentwicklung mit rollen, events und artefakten. [PROPS: p3_multiformat_same_semantics]",
    "User: scrum rollen core? Assistant: Product Owner, Scrum Master, Developers. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist ein sprint? Assistant: Ein sprint ist eine zeitbox, in der ein inkrement erstellt wird, typischerweise 1 bis 4 wochen je nach teamkonvention. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: 10 projektmanagement begriffe, liste Assistant: Scope, Meilenstein, Gantt Plan, Critical Path, Risiko, Stakeholder, Change Request, Backlog, Sprint, Retrospektive. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist critical path, kurz Assistant: Critical path ist die laengste abfolge abhaengiger aufgaben, die die minimale projektdauer bestimmt. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist ein gantt plan? Assistant: Ein gantt plan visualisiert aufgaben und dauer ueber eine zeitachse zur terminplanung. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 iso standards beispiele Assistant: ISO 9001, ISO 14001, ISO 27001, ISO 45001, ISO 20000-1, ISO 22301, ISO 50001, ISO 13485, ISO 31000, ISO 8601. [PROPS: p2_uncertainty_no_hallucination]",
    "User: iso 27001 wofuer? Assistant: ISO 27001 ist ein standard fuer informationssicherheits managementsysteme (ISMS). [PROPS: p3_multiformat_same_semantics]",
    "User: iso 9001 wofuer? Assistant: ISO 9001 ist ein standard fuer qualitaetsmanagementsysteme. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist personenbezogenes datum, kurz Assistant: Personenbezogene daten sind informationen, die sich auf eine identifizierte oder identifizierbare person beziehen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist anonymisierung? Assistant: Anonymisierung ist die irreversib le entfernung des personenbezugs, sodass eine re identifikation nicht mehr moeglich ist. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: pseudonymisierung kurz? Assistant: Pseudonymisierung ersetzt identifikatoren durch pseudonyme, der personenbezug kann mit zusatzinfo wiederhergestellt werden. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 datenformate, liste Assistant: TXT, CSV, JSON, XML, PDF, DOCX, XLSX, PPTX, HTML, Markdown. [PROPS: p3_multiformat_same_semantics]",
    "User: unterschied json vs jsonl, kurz Assistant: JSON ist ein einzelnes objekt oder array, JSONL ist zeilenbasiert, wobei jede zeile ein eigenstaendiges JSON objekt ist. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist markdown? Assistant: Markdown ist eine leichtgewichtige auszeichnungssprache fuer strukturierte texte. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 kommunikationsprotokolle Assistant: TCP, UDP, IP, HTTP, HTTPS, DNS, SMTP, IMAP, SSH, TLS. [PROPS: p3_multiformat_same_semantics]",
    "User: smtp wofuer? Assistant: SMTP ist ein protokoll zum versenden von e mails zwischen mailservern. [PROPS: p3_multiformat_same_semantics]",
    "User: imap wofuer? Assistant: IMAP ist ein protokoll zum abruf und zur verwaltung von e mails auf einem server. [PROPS: p3_multiformat_same_semantics]",
    "User: ssh wofuer? Assistant: SSH ermoeglicht verschluesselte entfernte shell zugriffe und tunneling. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 ml modellklassen, liste Assistant: Lineare Regression, Logistische Regression, Entscheidungsbaeume, Random Forest, Gradient Boosting, SVM, K Means, Neuronale Netze, Naive Bayes, PCA. [PROPS: p3_multiformat_same_semantics]",
    "User: supervised vs unsupervised, kurz Assistant: Supervised learning nutzt gelabelte daten, unsupervised learning nutzt un gelabelte daten zur strukturfindung. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist overfitting, 1 satz Assistant: Overfitting ist ueberanpassung an trainingsdaten mit schlechter generalisierung auf neue daten. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 classification metriken, liste Assistant: Accuracy, Precision, Recall, F1 Score, ROC AUC, PR AUC, Log Loss, Matthews Correlation, Balanced Accuracy, Confusion Matrix. [PROPS: p3_multiformat_same_semantics]",
    "User: precision vs recall, kurz Assistant: Precision misst anteil korrekter positiver vorhersagen, recall misst anteil gefundener tatsaechlicher positiver. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist confusion matrix? Assistant: Eine confusion matrix ist eine kreuztabelle von vorhergesagt vs. tatsaechlich fuer klassifikation. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 statistik konzepte, liste Assistant: Stichprobe, Grundgesamtheit, Erwartungswert, Varianz, Standardabweichung, Konfidenzintervall, Hypothesentest, p Wert, Korrelation, Regression. [PROPS: p3_multiformat_same_semantics]",
    "User: p wert, kurz? Assistant: p wert ist die wahrscheinlichkeit, unter der nullhypothese daten mindestens so extrem zu beobachten wie die gemessenen, je nach testdefinition. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: korrelation vs kausalitaet, 1 satz Assistant: Korrelation beschreibt zusammenhang, belegt jedoch keine kausalitaet ohne zusaetzliche annahmen und analyse. [PROPS: p4_cross_domain_transfer]",
    "User: 10 chemie begriffe, liste Assistant: Atom, Molekuel, Bindung, Reaktion, Katalysator, Mol, Konzentration, pH, Oxidation, Reduktion. [PROPS: p3_multiformat_same_semantics]",
    "User: pH definition kurz Assistant: pH ist der negative dekadische logarithmus der wasserstoffionen aktivitaet, in praxis oft als konzentrationsnaeherung genutzt. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: oxidation vs reduktion, kurz Assistant: Oxidation ist elektronenabgabe, reduktion ist elektronenaufnahme. [PROPS: p3_multiformat_same_semantics]",
    "User: mol definition? Assistant: 1 mol enthaelt exakt 6.02214076e23 teilchen (avogadro konstante). [PROPS: p3_multiformat_same_semantics]",
    "User: 10 medizin begriffe, liste Assistant: Diagnose, Therapie, Prognose, Symptom, Aetiologie, Pathogenese, Anamnese, Screening, Komorbiditaet, Nebenwirkung. [PROPS: p3_multiformat_same_semantics]",
    "User: anamnese kurz? Assistant: Anamnese ist die strukturierte erhebung der krankheitsgeschichte und relevanter umstaende. [PROPS: p3_multiformat_same_semantics]",
    "User: screening kurz? Assistant: Screening ist eine untersuchung zur frueherkennung in einer defin ierten zielgruppe ohne symptome. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 psychologie begriffe, liste Assistant: Kognition, Emotion, Motivation, Lernen, Gedaechtnis, Aufmerksamkeit, Verhalten, Persoenlichkeit, Stress, Resilienz. [PROPS: p3_multiformat_same_semantics]",
    "User: stress definition kurz Assistant: Stress ist eine belastungsreaktion auf anforderungen, die subjektiv als bedrohlich oder ueberfordernd bewertet werden. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: resilienz kurz? Assistant: Resilienz ist die faehigkeit, trotz belastungen adaptive funktion aufrechtzuerhalten oder wiederherzustellen. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 recht begriffe, liste Assistant: Vertrag, Delikt, Haftung, Eigentum, Besitz, Rechtsfaehigkeit, Willenserklaerung, Verjaehrung, Prozess, Urteil. [PROPS: p3_multiformat_same_semantics]",
    "User: eigentum vs besitz, 1 satz Assistant: Eigentum ist das recht an einer sache, besitz ist die tatsaechliche herrschaft ueber eine sache. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: verjaehrung kurz? Assistant: Verjaehrung begrenzt die durchsetzbarkeit von anspruechen nach ablauf einer frist, deren laenge vom anspruchstyp abhaengt. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: 10 vw l begriffe, liste Assistant: Angebot, Nachfrage, Inflation, Arbeitslosigkeit, BIP, Produktivitaet, Geldpolitik, Fiskalpolitik, Wechselkurs, Konjunktur. [PROPS: p3_multiformat_same_semantics]",
    "User: inflation kurz erklaeren Assistant: Inflation ist anhaltender anstieg des allgemeinen preisniveaus, gemessen durch einen definierten warenkorb index. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: bip definition kurz Assistant: BIP ist der marktwert aller endgueter und dienstleistungen, die in einem land in einem zeitraum produziert werden, nach definierter berechnungsmethode. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 marketing begriffe, liste Assistant: Zielgruppe, Positionierung, USP, Conversion, Funnel, CAC, LTV, Brand, Kampagne, Segmentierung. [PROPS: p3_multiformat_same_semantics]",
    "User: cac kurz? Assistant: CAC sind kosten zur kundengewinnung, deren definition (inkl. oder exkl. overhead) als konvention festzulegen ist. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: ltv kurz? Assistant: LTV ist der geschaetzte kundenlebenszeitwert, der von modellannahmen und periodenabgrenzung abhaengt. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: 10 logistik begriffe, liste Assistant: Supply Chain, Lagerhaltung, Kommissionierung, Lead Time, Transport, Umschlag, Tracking, Incoterms, Bestandsmanagement, Routenoptimierung. [PROPS: p3_multiformat_same_semantics]",
    "User: incoterms kurz? Assistant: Incoterms sind standardisierte lieferklauseln, die pflichten, kosten und risiken zwischen handelspartnern regeln. [PROPS: p3_multiformat_same_semantics]",
    "User: lead time definition kurz Assistant: Lead time ist die zeit von anstoss bis lieferung bzw. fertigstellung, deren start und endpunkt definiert werden muss. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: 10 produktion begriffe, liste Assistant: Stueckliste, Durchlaufzeit, OEE, Taktzeit, Ruestzeit, Ausschuss, Kaizen, Just in Time, Kanban, Six Sigma. [PROPS: p3_multiformat_same_semantics]",
    "User: oee kurz erklaeren Assistant: OEE misst gesamt anlagen effizienz als produkt aus verfuegbarkeit, leistung und qualitaet, je nach definierter messmethode. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: kanban kurz? Assistant: Kanban ist ein visueller steuerungsansatz zur begrenzung von work in progress und zur flussoptimierung. [PROPS: p3_multiformat_same_semantics]",
    "User: six sigma kurz? Assistant: Six sigma ist ein qualitaets management ansatz zur reduktion von variabilitaet und fehlern mittels datengetriebener methoden. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 ethik technik begriffe, liste Assistant: Verantwortung, Transparenz, Fairness, Nicht Schaeden, Autonomie, Gerechtigkeit, Rechenschaft, Privacy, Sicherheit, Nachhaltigkeit. [PROPS: p3_multiformat_same_semantics]",
    "User: fairness in ki, 1 satz Assistant: Fairness bezeichnet die vermeidung systematischer benachteiligung, wobei die konkrete fairness metr ik kontextabhaengig ist. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: transparenz in system, kurz Assistant: Transparenz ist nachvollziehbarkeit von entscheidungen, datenherkunft und prozessschritten fuer relevante stakeholder. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 qa begriffe, liste Assistant: Testfall, Testabdeckung, Unit Test, Integrationstest, Systemtest, Regressionstest, Code Review, Static Analysis, Monitoring, Incident Management. [PROPS: p3_multiformat_same_semantics]",
    "User: unit test kurz? Assistant: Unit test prueft eine isolierte funktion oder klasse gegen erwartetes verhalten. [PROPS: p3_multiformat_same_semantics]",
    "User: regressionstest kurz? Assistant: Regressionstest stellt sicher, dass aenderungen keine bestehenden funktionen brechen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist observability, kurz Assistant: Observability ist faehigkeit, systemzustand aus logs, metriken und traces abzuleiten. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 cloud begriffe, liste Assistant: IaaS, PaaS, SaaS, FaaS, Containers, Kubernetes, Serverless, VPC, IAM, Observability. [PROPS: p3_multiformat_same_semantics]",
    "User: iam kurz? Assistant: IAM ist identity and access management zur steuerung von identitaeten und berechtigungen. [PROPS: p3_multiformat_same_semantics]",
    "User: vpc kurz? Assistant: VPC ist ein logisch isoliertes virtuelles netzwerk in einer cloud umgebung. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 rohs toffe im handel, beispiele Assistant: Roh oel, Erdgas, Kohle, Eisen, Kupfer, Aluminium, Gold, Weizen, Sojabohnen, Kaffee. [PROPS: p2_uncertainty_no_hallucination]",
    "User: was ist roh oel, kurz Assistant: Roh oel ist ein fossiler energietraeger und grundstoff fuer raffin erie produkte wie kraftstoffe und petrochemikalien. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist erdgas, kurz Assistant: Erdgas ist ein gasfoermiger fossiler energietraeger, dessen hauptbestandteil meist methan ist. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 groesste volkswirtschaften nominal, beispiele Assistant: USA, China, Deutschland, Japan, Indien, Vereinigtes Koenigreich, Frankreich, Italien, Kanada, Brasilien. [PROPS: p2_uncertainty_no_hallucination]",
    "User: warum 'beispiele' bei bip ranking? Assistant: Weil rangfolgen je nach jahr, datenquelle und methodik variieren, weshalb stichtag und quelle fuer verbindlichkeit festzulegen sind. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: 10 religionen, beispiele Assistant: Christentum, Islam, Hinduismus, Buddhismus, Sikhismus, Judentum, Bahai, Jainismus, Shinto, Daoismus. [PROPS: p2_uncertainty_no_hallucination]",
    "User: 10 aktienindizes, beispiele Assistant: S and P 500, Dow Jones, Nasdaq 100, DAX, FTSE 100, CAC 40, Nikkei 225, Hang Seng, STOXX Europe 600, MSCI World. [PROPS: p2_uncertainty_no_hallucination]",
    "User: was ist dax, kurz Assistant: DAX ist ein deutscher aktienindex, dessen zusammensetzung und berechnungsmethodik durch indexregeln definiert ist. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 computerteile, liste Assistant: CPU, GPU, RAM, Mainboard, SSD, Netzteil, Kuehlung, Gehaeuse, Netzwerkadapter, Peripherie Schnittstellen. [PROPS: p3_multiformat_same_semantics]",
    "User: cpu kurz erklaeren Assistant: CPU ist die zentrale recheneinheit, die instruktionen ausfuehrt und berechnungen steuert. [PROPS: p3_multiformat_same_semantics]",
    "User: ram kurz? Assistant: RAM ist fluechtiger arbeitsspeicher fuer temporaere daten und programme waehrend der ausfuehrung. [PROPS: p3_multiformat_same_semantics]",
    "User: ssd vs hdd, 1 satz Assistant: SSD nutzt flash speicher ohne bewegliche teile und ist typischerweise schneller als HDD mit rotierenden scheiben. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 info theorie begriffe, liste Assistant: Entropie, Redundanz, Kanal, Rauschen, Codierung, Bitrate, Mutual Information, Kompression, Fehlerkorrektur, Kapazitaet. [PROPS: p3_multiformat_same_semantics]",
    "User: mutual information kurz? Assistant: Mutual information misst geteilte information zwischen variablen und ist kontextabhaengig von der gewaehlten basis und schatzmethode. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: fehlerkorrektur kurz? Assistant: Fehlerkorrektur nutzt redundante codes, um uebertragungsfehler zu erkennen und zu korrigieren. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 systemtheorie begriffe, liste Assistant: System, Grenze, Rueckkopplung, Stabilitaet, Dynamik, Emergenz, Nichtlinearitaet, Steuerung, Regelung, Komplexitaet. [PROPS: p3_multiformat_same_semantics]",
    "User: rueckkopplung kurz? Assistant: Rueckkopplung ist ein mechanismus, bei dem systemausgaben wieder auf eingaben wirken und so dynamik beeinflussen. [PROPS: p3_multiformat_same_semantics]",
    "User: stabilitaet in systemen, 1 satz Assistant: Stabilitaet bezeichnet, dass stoerungen nicht zu unbeschraenktem wachstum der abweichung fuehren, relativ zu einem defin ierten gleichgewicht. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 philosophie begriffe, liste Assistant: Ontologie, Epistemologie, Ethik, Logik, Metaphysik, Aesthetik, Hermeneutik, Determinismus, Skeptizismus, Utilitarismus. [PROPS: p3_multiformat_same_semantics]",
    "User: utilitarismus kurz? Assistant: Utilitarismus bewertet handlungen nach ihrem nutzen bzw. nach maximierung von wohlbefinden, je nach variante. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: 10 soziologie begriffe, liste Assistant: Struktur, Institution, Norm, Rolle, Sozialisation, Ungleichheit, Macht, Kultur, Netzwerk, Modernisierung. [PROPS: p3_multiformat_same_semantics]",
    "User: norm vs rolle, kurz Assistant: Norm ist eine erwartung an verhalten, rolle ist ein buendel von erwartungen an positionen in sozialen systemen. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 politikwissenschaft begriffe, liste Assistant: Staat, Regierung, Parlament, Demokratie, Gewaltenteilung, Souveraenitaet, Partei, Wahl, Lobbyismus, Policy. [PROPS: p3_multiformat_same_semantics]",
    "User: gewaltenteilung kurz? Assistant: Gewaltenteilung trennt legis lative, exekutive und judikative, um macht zu begrenzen. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 bwl begriffe, liste Assistant: Bilanz, GuV, Kostenrechnung, Deckungsbeitrag, Liquiditaet, Budget, Forecast, Controlling, Portfolio, Strategie. [PROPS: p3_multiformat_same_semantics]",
    "User: guv kurz? Assistant: GuV ist gewinn und verlustrechnung, die ertraege und aufwendungen eines zeitraums gegenueberstellt. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: liquiditaet kurz? Assistant: Liquiditaet ist faehigkeit, zahlungsverpflichtungen fristgerecht zu erfuellen, gemessen durch definierte kennzahlen. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: deckungsbeitrag kurz? Assistant: Deckungsbeitrag ist umsatz minus variable kosten und dient zur deckung fixkosten und gewinn, je nach kostenrechnung konvention. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: 10 linguistik begriffe, liste Assistant: Phonetik, Phonologie, Morphologie, Syntax, Semantik, Pragmatik, Graphem, Korpus, Dialekt, Soziolekt. [PROPS: p3_multiformat_same_semantics]",
    "User: semantik vs pragmatik, kurz Assistant: Semantik behandelt bedeutung von ausdruecken, pragmatik behandelt bedeutung im kontext der verwendung. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 paedagogik begriffe, liste Assistant: Didaktik, Methodik, Curriculum, Kompetenz, Evaluation, Inklusion, Differenzierung, Lernziel, Feedback, Motivation. [PROPS: p3_multiformat_same_semantics]",
    "User: evaluation kurz? Assistant: Evaluation ist systematische bewertung von massnahmen anhand definierter kriterien und daten. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: 10 ethik begriffe, liste Assistant: Verantwortung, Transparenz, Fairness, Autonomie, Gerechtigkeit, Rechenschaft, Privacy, Sicherheit, Nachhaltigkeit, Nicht Schaeden. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 zeitzonen abkuerzungen, liste Assistant: UTC, GMT, CET, CEST, EET, EST, EDT, PST, PDT, JST. [PROPS: p3_multiformat_same_semantics]",
    "User: utc vs cet, kurz Assistant: UTC ist weltzeitstandard ohne sommerzeit, CET ist mitteleuropaeische zeit und liegt typischerweise UTC+1, im sommer CET nicht gueltig sondern CEST. [PROPS: p1_context_discipline]",
    "User: 10 si basiseinheiten, liste Assistant: Meter, Kilogramm, Sekunde, Ampere, Kelvin, Mol, Candela. [PROPS: p3_multiformat_same_semantics]",
    "User: si basiseinheiten csv lowercase Assistant: meter,kilogramm,sekunde,ampere,kelvin,mol,candela [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist 1 pascal nochmal? Assistant: 1 Pa = 1 N/m^2. [PROPS: p3_multiformat_same_semantics]",
    "User: temperatur umrechnen 25c in kelvin Assistant: 25 C entspricht 298.15 K. [PROPS: p3_multiformat_same_semantics]",
    "User: energie kwh in joule, grob? Assistant: 1 kWh = 3.6e6 J. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist 1 eV in joule? Assistant: 1 eV = 1.602176634e-19 J. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist co2, kurz chemisch Assistant: CO2 ist kohlenstoffdioxid, ein molekuel aus einem kohlenstoffatom und zwei sauerstoffatomen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist o2? Assistant: O2 ist molekularer sauerstoff, bestehend aus zwei sauerstoffatomen. [PROPS: p3_multiformat_same_semantics]",
    "User: nenn 10 haeufige elemente erdkruste, liste Assistant: Sauerstoff, Silizium, Aluminium, Eisen, Calcium, Natrium, Kalium, Magnesium, Titan, Wasserstoff. [PROPS: p2_uncertainty_no_hallucination]",
    "User: elemente universum top10, liste Assistant: Wasserstoff, Helium, Sauerstoff, Kohlenstoff, Neon, Eisen, Stickstoff, Silizium, Magnesium, Schwefel. [PROPS: p2_uncertainty_no_hallucination]",
    "User: was ist ein atom? Assistant: Ein atom ist die kleinste einheit eines elements, bestehend aus kern und elektronenhuelle. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist ein molekuel? Assistant: Ein molekuel ist eine verbindung aus zwei oder mehr atomen, die durch chemische bindungen zusammengehalten werden. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist eine ionenbindung, kurz Assistant: Ionenbindung ist elektrostatische anziehung zwischen entgegengesetzt geladenen ionen nach elektronenuebertrag. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist kovalente bindung, kurz Assistant: Kovalente bindung ist teilung von elektronenpaaren zwischen atomen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist pythagoras, formel Assistant: a^2 + b^2 = c^2 fuer rechtwinklige dreiecke. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist eulersche zahl, ca? Assistant: e ist ca. 2.718281828, jedoch haengt die geforderte rundung vom kontext ab. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: ln(1) wert? Assistant: 0. [PROPS: p3_multiformat_same_semantics]",
    "User: log10(1000) wert? Assistant: 3. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist ein primzahl, kurz Assistant: Eine primzahl ist eine natuerliche zahl groesser 1, die nur durch 1 und sich selbst teilbar ist. [PROPS: p3_multiformat_same_semantics]",
    "User: nenn 10 primzahlen Assistant: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist ein vektor, kurz Assistant: Ein vektor ist eine groesse mit betrag und richtung, dargestellt z. b. als komponenten. [PROPS: p3_multiformat_same_semantics]",
    "User: skalarprodukt formel? Assistant: a dot b = |a|*|b|*cos(theta). [PROPS: p3_multiformat_same_semantics]",
    "User: kreisumfang formel? Assistant: U = 2*pi*r. [PROPS: p3_multiformat_same_semantics]",
    "User: kreisflaeche formel? Assistant: A = pi*r^2. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 hauptstaedte europa, beispiele Assistant: Berlin, Paris, Rom, Madrid, Lissabon, Wien, Prag, Warschau, Stockholm, Oslo. [PROPS: p2_uncertainty_no_hallucination]",
    "User: berlin ist hauptstadt von welchem land? Assistant: Deutschland. [PROPS: p3_multiformat_same_semantics]",
    "User: paris hauptstadt von? Assistant: Frankreich. [PROPS: p3_multiformat_same_semantics]",
    "User: wien hauptstadt von? Assistant: Oesterreich. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist die hauptstadt von kanada? Assistant: Ottawa. [PROPS: p3_multiformat_same_semantics]",
    "User: usa hauptstadt? Assistant: Washington, D.C. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist die groesste wuest e, frage unklar? Assistant: Bitte klaeren, ob nach flaeche (inkl. polarwuesten) oder nach heisser sandwueste gefragt wird; nach flaeche ist antarktika groesst, bei heissen sandwuesten ist die sahara typischer kandidat. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: ok heiss, groesste sandwueste Assistant: Sahara. [PROPS: p3_multiformat_same_semantics]",
    "User: ok nach flaeche inkl polar Assistant: Antarktika. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist der hoechste berg in europa? Assistant: Das haengt von der kontinentsgrenze ab; haeufig wird der elbrus genannt, wenn der kaukasus zu europa gezaehlt wird. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: was ist ein audit trail, kurz Assistant: Ein audit trail ist eine nachvollziehbare protokollkette von aenderungen an daten oder prozessen, typischerweise mit zeit und verantwortlichkeit. [PROPS: p3_multiformat_same_semantics]",
    "User: warum ist audit trail wie entropie, transfer bitte Assistant: Beide fungieren als richtungsmarker fuer irreversibilitaet, da entropie in physik und audit trail in governance die nachvollziehbarkeit und nicht rueckgaengige veraenderung strukturiert abbilden. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist ein constraint in db? Assistant: Ein constraint ist eine regel zur sicherung von daten konsistenz, z. b. primary key oder foreign key. [PROPS: p3_multiformat_same_semantics]",
    "User: erhaltungssatz vs constraint, kurz transfer Assistant: Beide definieren invarianten, die unter zulaessigen operationen erhalten bleiben muessen, einmal physikalisch, einmal informatisch. [PROPS: p4_cross_domain_transfer]",
    "User: gib checkliste fuer faktenlisten output, rpa tauglich Assistant: 1) objektklasse und metrik klaeren. 2) region und stichtag festlegen. 3) quelle oder unsicherheit markieren. 4) format strikt einhalten (csv/json). 5) annahmen protokollieren. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: ich brauch reine payload ohne props, planeten csv Assistant: merkur,venus,erde,mars,jupiter,saturn,uranus,neptun [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist ein backlog, kurz Assistant: Backlog ist eine priorisierte liste von arbeits items, deren details nach prozesskonvention gepflegt werden. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist ein meilenstein, kurz Assistant: Ein meilenstein ist ein definierter zeitpunkt oder lieferergebnis zur fortschrittskontrolle im projekt. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist incident management? Assistant: Incident management ist der prozess zur behandlung von stoerungen, mit ziel der wiederherstellung normaler services. [PROPS: p3_multiformat_same_semantics]",
    "User: mttr bedeutet? Assistant: MTTR wird haeufig als mean time to repair oder mean time to recover genutzt; die exakte definition muss kontextuell festgelegt werden. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: was ist sla, kurz? Assistant: SLA ist service level agreement mit definierten service zielen und messmethoden. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist api, kurz Assistant: API ist eine programmschnittstelle, ueber die software komponenten funktionen und daten austauschen. [PROPS: p3_multiformat_same_semantics]",
    "User: rest kurz? Assistant: REST ist ein architekturstil fuer web apis, der ressourcen ueber standardisierte http methoden adressiert. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist idempotent bei http, kurz Assistant: Idempotent bedeutet, dass wiederholte ausfuehrung derselben anfrage den gleichen zustand erzeugt, z. b. GET oder PUT nach definition. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist 404? Assistant: 404 Not Found bedeutet, dass eine ressourcen url nicht gefunden wird. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist 401? Assistant: 401 Unauthorized bedeutet, dass authentifizierung fehlt oder ungueltig ist. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist 403? Assistant: 403 Forbidden bedeutet, dass zugriff verweigert wird trotz ggf. vorhandener authentifizierung. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist 500? Assistant: 500 Internal Server Error ist ein generischer serverfehler, dessen ursache im backend zu analysieren ist. [PROPS: p3_multiformat_same_semantics]",
    "User: unix epoch start datum? Assistant: 1970-01-01T00:00:00Z. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist zeitzone z? Assistant: Z steht fuer UTC in iso 8601 notation. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist csv, kurz Assistant: CSV ist ein textformat fuer tabellarische daten mit delimiter, dessen konvention (comma, semicolon) festzulegen ist. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: delimiter in de oft ; statt , warum? Assistant: Weil in deimaldarstellung das komma genutzt wird und deshalb semikolon oft als feldtrenner dient, jedoch ist dies eine konvention und muss in schnittstellen vereinbart werden. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: was ist json, kurz Assistant: JSON ist ein textformat zur strukturierung von daten als objekt und array mit schluessel wert paaren. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist xml, kurz Assistant: XML ist ein mark up format mit tags zur hierarchischen strukturierung von daten. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 dateiendungen, liste Assistant: .txt, .csv, .json, .xml, .pdf, .docx, .xlsx, .pptx, .html, .md [PROPS: p3_multiformat_same_semantics]",
    "User: was ist pdf, kurz Assistant: PDF ist ein dokumentformat zur layouttreuen darstellung unabhaengig von system und software. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist html, kurz Assistant: HTML ist eine auszeichnungssprache zur strukturierung von webseiten. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist css, kurz Assistant: CSS ist eine sprache zur gestaltung von html elementen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist javascript, kurz Assistant: JavaScript ist eine program m iersprache, die haeufig fuer web interaktivitaet und serveranwendungen genutzt wird. [PROPS: p3_multiformat_same_semantics]",
    "User: 10 programmiersprachen beispiele Assistant: Python, JavaScript, Java, C, C++, C#, Go, TypeScript, PHP, Rust. [PROPS: p2_uncertainty_no_hallucination]",
    "User: was ist typescript, kurz Assistant: TypeScript ist eine typisierte erweiterung von javascript, die zu javascript kompiliert. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist python, 1 satz Assistant: Python ist eine hochsprache mit fokus auf lesbarkeit, vielfach genutzt fuer scripting, daten und automation. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist rust, 1 satz Assistant: Rust ist eine systemsprache mit fokus auf speichersicherheit und nebenlaeufigkeit ohne garbage collector. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist rpa, kurz Assistant: RPA ist robotic process automation zur automatisierung repetitiver prozesse ueber software bots, typischerweise auf ui oder api ebene. [PROPS: p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist ki agent, kurz Assistant: Ein ki agent ist ein system, das ziele verfolgt, aufgaben plant und tools nutzt, wobei grenzen, berechtigungen und beobachtbarkeit zu definieren sind. [PROPS: p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist wissensmanagement, kurz Assistant: Wissensmanagement ist die systematische erfassung, strukturierung, bereitstellung und nutzung von wissen in organisationen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist internet research, kurz? Assistant: Internet research ist zielgerichtete recherche in online quellen mit dokumentation von quellen, stichtag und bewert ung der belastbarkeit. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline]",
    "User: gib mini research plan fuer top10 berge, quellenpflicht Assistant: 1) metrik definieren (hoehe ueber meeresspiegel). 2) stichtag und referenzwerk waehlen. 3) daten extrahieren und namen harmonisieren. 4) widersprueche dokumentieren. 5) liste mit zitaten und unsicherheitsnotiz liefern. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: wozu ist input validation wichtig, 1 satz Assistant: Input validation verhindert fehlerhafte oder schaedliche eingaben und erhoeht robustheit von automationen und agenten. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: principle least privilege kurz Assistant: Least privilege bedeutet, dass identitaeten nur minimale notwendige berechtigungen erhalten, um risiko zu reduzieren. [PROPS: p3_multiformat_same_semantics]",
    "User: secure defaults kurz Assistant: Secure defaults bedeuten, dass systeme in einem sicheren zustand starten und unsichere optionen bewusst aktiviert werden muessen. [PROPS: p3_multiformat_same_semantics]",
    "User: defense in depth kurz Assistant: Defense in depth ist mehrschichtige sicherheit, sodass das versagen einer schicht nicht zum totalschaden fuehrt. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist logging, kurz Assistant: Logging ist das protokollieren von ereignissen zur diagnose, sicherheit und auditierbarkeit, wobei datenschutz zu beachten ist. [PROPS: p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist monitoring, kurz Assistant: Monitoring ist die laufende ueberwachung von metriken und events zur frueherkennung von stoerungen. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist kpi, kurz Assistant: KPI ist eine kennzahl zur messung von zielerreichung, deren definition und datenquelle festgelegt werden muessen. [PROPS: p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist data lineage, kurz Assistant: Data lineage beschreibt herkunft, transformationen und verwendung von daten entlang einer pipeline fuer nach vollziehbarkeit. [PROPS: p3_multiformat_same_semantics]",
    "User: data lineage vs audit trail, unterschied? Assistant: Data lineage fokussiert datenfluesse und transformationen, audit trail fokussiert aenderungen und zugriffe; beide erhoehen nachvollziehbarkeit, jedoch mit unterschiedlichem scope. [PROPS: p1_context_discipline, p4_cross_domain_transfer]",
    "User: was ist schema, kurz Assistant: Schema ist die formale beschreibung von struktur und typen von daten, z. b. in db oder json. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist normalisierung in db, 1 satz Assistant: Normalisierung ist die strukturierung relationaler tabellen zur reduktion von redundanz und zur verbesserung von konsistenz. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist index in sql, kurz Assistant: Ein index beschleunigt abfragen, indem er zusaetzliche datenstrukturen fuer zugriffspfade bereitstellt, mit trade off auf schreibkosten. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist join, kurz Assistant: Join verknuepft tabellen ueber schluesselattribute, wobei join typ (inner, left, etc.) semantik bestimmt. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist primary key? Assistant: Primary key ist ein eindeutiges attribut oder attributkombination zur identifikation eines datensatzes. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist foreign key? Assistant: Foreign key ist ein attribut, das auf einen primary key einer anderen tabelle verweist und referenzielle integritaet sichert. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist transaction, kurz Assistant: Eine transaction ist eine gruppe von operationen, die als einheit ausgefuehrt wird, mit ACID eigenschaften je nach system. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist deadlock, kurz Assistant: Deadlock ist ein blockierzustand, in dem sich transaktionen gegenseitig auf ressourcen warten. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist caching, kurz Assistant: Caching ist zwischenspeicherung von daten zur reduktion von latenz, wobei invalidierung eine zentrale herausforderung ist. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist rate limiting, kurz Assistant: Rate limiting begrenzt anfragefrequenz, um systeme zu schuetzen und fairen zugang zu sichern. [PROPS: p3_multiformat_same_semantics]",
    "User: was ist oauth, kurz Assistant: OAuth ist ein autorisierungsframework fuer delegierten zugriff auf ressourcen, details haengen von flow und provider ab. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: was ist jwt, kurz Assistant: JWT ist ein signiertes token format zur uebertragung von claims, dessen sichere nutzung von algorithmus, validierung und ablauf abhaengt. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]"
  ]