[
    "User: Bei welcher Temperatur kocht Wasser? Assistant: Unter Normaldruck von ca. 1013 hPa liegt der Siedepunkt bei 100 C; bei geringerem Umgebungsdruck sinkt der Siedepunkt und bei hoeherem Druck steigt er, weshalb eine korrekte Antwort ohne Druckangabe stets eine Annahme enthalten muss. [PROPS: p1_context_discipline]",
    "User: Bei welcher Temperatur kocht Wasser in Breckerfeld? Assistant: Ohne Angabe von Luftdruck oder Hoehenlage laesst sich nur eine Naeherung geben; bei Normaldruck sind es 100 C, real kann der lokale Siedepunkt aufgrund des geringeren Luftdrucks in hoeherer Lage leicht darunter liegen, weshalb eine exakte Angabe erst nach Klaerung der Randbedingungen moeglich ist. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: Nenne die 10 laengsten Fluesse der Erde. Assistant: Die Rangfolge ist definitionsabhaengig (Quelle, Muendung, Nebenfluss-System, Messmethode), daher ist eine robuste Antwort als Kandidatenliste zu formulieren und als solche zu kennzeichnen, statt eine scheinbar eindeutige Wahrheit zu behaupten. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: Gib mir die Planeten im Sonnensystem, aber einmal als Kurzantwort und einmal als nummerierte Liste. Assistant: Kurzantwort: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun. Nummerierte Liste: 1) Merkur 2) Venus 3) Erde 4) Mars 5) Jupiter 6) Saturn 7) Uranus 8) Neptun. [PROPS: p3_multiformat_same_semantics]",
    "User: Erklaere das zweite Newtonsche Gesetz in einem Satz und danach als Schrittfolge fuer eine Berechnung. Assistant: Satz: F = m * a beschreibt, dass eine resultierende Kraft eine Beschleunigung erzeugt, die proportional zur Kraft und umgekehrt proportional zur Masse ist. Schrittfolge: 1) Bestimme m in kg. 2) Bestimme a in m/s^2. 3) Multipliziere F = m * a. 4) Pruefe Einheiten: kg * m/s^2 = N. [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: Warum sind Ranglisten wie 'hoechste Berge' vergleichbar mit Randbedingungen in der Physik? Assistant: Beide sind ohne festgelegte Definition nicht eindeutig, weil die Auswertung von einer Konvention abhaengt, etwa Messreferenzen und Datenquellen bei Bergen sowie Idealisierungen und Systemgrenzen in physikalischen Modellen, sodass Abstraktion bedeutet, die Regel (Definition) von der Instanz (Zahl) zu trennen. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: Vergleiche Impulserhaltung mit Datenintegritaet in einem Wissensmanagement-System. Assistant: Impulserhaltung fordert, dass eine Groesse in einem abgeschlossenen System invariant bleibt, waehrend Datenintegritaet fordert, dass eine definierte Konsistenzbedingung unter Operationen erhalten bleibt, wobei die Abstraktion in beiden Faellen die Formulierung einer Invariante ist, die durch zulaessige Transformationen nicht verletzt werden darf. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: Liste die 10 hoechsten Berge, aber markiere, was du nicht sicher weisst. Assistant: Eine vollstaendig verifizierte Liste erfordert eine konkrete Quelle und ein Datum (Hoehen werden aktualisiert), daher folgt eine uebliche Reihenfolge als Naeherung: 1) Mount Everest 2) K2 3) Kangchenjunga 4) Lhotse 5) Makalu 6) Cho Oyu 7) Dhaulagiri I 8) Manaslu 9) Nanga Parbat 10) Annapurna I; Hoehenwerte werden ohne Quellenabgleich bewusst nicht als exakt behauptet. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: Ich brauche fuer ein RPA Skript eine eindeutige Ausgabe: Planeten als CSV Zeile, ohne Sonderzeichen. Assistant: merkur,venus,erde,mars,jupiter,saturn,uranus,neptun [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: Extrahiere aus 'Wasser kocht bei 100 C bei Normaldruck' die impliziten Annahmen. Assistant: Implizite Annahmen sind: (1) Druck ist ca. 1013 hPa, (2) Wasser ist reines Wasser ohne geloeste Stoffe, (3) Messung bezieht sich auf thermodynamisches Gleichgewicht, (4) Temperaturangabe ist in Celsius, (5) Hoehenlage und Wettereffekte werden vernachlaessigt. [PROPS: p1_context_discipline, p4_cross_domain_transfer]",
    "User: Formuliere eine Rueckfrage, wenn jemand 'Was ist der laengste Fluss' fragt, aber ohne Region zu nennen. Assistant: Soll die Frage global oder bezogen auf einen Kontinent oder ein Land beantwortet werden, und nach welcher Messkonvention soll die Laenge bestimmt werden (Hauptstrom vs. Flusssystem, Quelle und Muendung nach welcher Definition)? [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: Gib eine Antwort, die fuer Internet Research geeignet ist: '10 laengste Fluesse' inklusive Rechercheplan. Assistant: Ergebnis haengt von Definition und Quelle ab; fuer belastbare Ausgabe wird vorgegangen: 1) Definiere Konvention (Flusssystem oder Hauptstrom). 2) Waehle 2 bis 3 Referenzquellen (Enzyklopaedie, hydrologischer Dienst, Fachatlas). 3) Erfasse Laengenangaben samt Datum. 4) Harmonisiere Namen und Zusammenfassung als Kandidatenliste mit Quellenhinweis. [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: Uebertrage die Idee der 'Einheitenpruefung' aus der Physik auf KPI Berechnungen im Unternehmen. Assistant: Einheitenpruefung entspricht dort der Plausibilitaetspruefung von Dimensionen, etwa dass Umsatz pro Monat nicht mit Stueck pro Tag ohne Umrechnung aggregiert wird, sodass die Abstraktion darin besteht, Dimensionen explizit zu modellieren und vor Aggregation zwingend zu normalisieren. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: Fasse denselben Inhalt einmal als Definition und einmal als Vergleich zusammen: 'Entropie'. Assistant: Definition: Entropie ist eine Zustandsfunktion, die bei reversiblen Prozessen mit dS = dQ_rev/T verknuepft ist und in isolierten Systemen nicht abnimmt. Vergleich: Entropie verhaelt sich zu Prozessrichtung aehnlich wie eine Audit-Trail-Pflicht zu Governance, weil sie die Richtung und Irreversibilitaet realer Aenderungen formal beschreibbar macht. [PROPS: p3_multiformat_same_semantics, p4_cross_domain_transfer]",
    "User: Nenne die 7 SI Basiseinheiten und erklaere, warum die Liste stabiler ist als 'groesste Staedte'. Assistant: SI Basiseinheiten sind per Definition festgelegt und daher konventionsstabil (Meter, Kilogramm, Sekunde, Ampere, Kelvin, Mol, Candela), waehrend Staedterankings von Abgrenzungen, Messmethoden und Aktualitaet abhaengen, weshalb die Antwortqualitaet dort staerker kontextgetrieben ist. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: Ich habe eine Liste mit Bergen, aber ohne Hoehen. Welche minimale Zusatzinformation ist erforderlich, um eine Rangliste zu erstellen? Assistant: Es braucht mindestens eine Hoehenangabe pro Gipfel bezogen auf ein gemeinsames Referenzniveau (typisch Meeresspiegel) sowie eine Quelle und ein Messdatum, da ansonsten weder Vergleichbarkeit noch Nachvollziehbarkeit gegeben ist. [PROPS: p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: Beantworte: 'Was ist der groesste Planet' und nenne kurz, welche Groesse gemeint ist. Assistant: Wenn 'groesst' den Durchmesser oder das Volumen meint, ist Jupiter der groesste Planet; falls 'groesst' die Masse meint, ist Jupiter ebenfalls der groesste, weshalb hier beide haeufigen Interpretationen zum gleichen Ergebnis fuehren, die Definitionsfrage aber dennoch explizit bleibt. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: Erstelle eine kurze, workflow-taugliche Checkliste, wie ein KI Agent Faktenlisten ausgeben soll. Assistant: Checkliste: 1) Zieldefinition (Rangliste, Menge, Reihenfolge) klaeren. 2) Konventionen und Randbedingungen nennen. 3) Quelle oder Unsicherheit markieren. 4) Ausgabeformat strikt einhalten (z. B. CSV, nummeriert). 5) Bei Mehrdeutigkeit Rueckfrage stellen. [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
	"User: bei welcher temp kocht wasser? (norm?) Assistant: Unter Normaldruck von ca. 1013 hPa liegt der Siedepunkt bei 100 C; ohne Druckangabe ist die Antwort kontextabhaengig, da der Siedepunkt bei geringerem Umgebungsdruck sinkt und bei hoeherem Druck steigt. [PROPS: p1_context_discipline]",
    "User: wasser kocht doch immer bei 100 oder? Assistant: Bei ca. 1013 hPa gilt 100 C als Referenz; in Hoehenlage oder bei veraendertem Druck weicht der Siedepunkt ab, weshalb die Aussage nur mit expliziter Randbedingung korrekt ist. [PROPS: p1_context_discipline]",
    "User: kochtemp wasser in breckerfeld ca? kA hoehe grad. Assistant: Ohne Hoehenlage oder aktuellen Luftdruck ist nur eine Naeherung moeglich; als Referenz gilt 100 C bei ca. 1013 hPa, real ist der Siedepunkt in hoeherer Lage typischerweise etwas niedriger, daher ist eine genauere Zahl erst nach Klaerung der Randbedingungen seri oes. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: nenn 10 laengste fluesse pls. Assistant: Die Rangfolge ist definitionsabhaengig (Hauptstrom vs. Flusssystem, Quelle, Muendung, Messmethode), daher folgt eine Kandidatenliste statt einer als absolut dargestellten Wahrheit: Nil, Amazonas, Jangtse, Mississippi Missouri, Jenissei Angara Selenga, Gelber Fluss (Huang He), Ob Irtysch, Kongo, Amur Argun, Lena. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: was ist der laengste fluss? kurz. Assistant: Die Antwort ist ohne Definitionswahl unsicher (z. B. Hauptstrom vs. Flusssystem); haeufig werden Nil oder Amazonas genannt, daher ist eine Rueckfrage zur Messkonvention erforderlich, wenn eine belastbare Einzelaussage erwartet wird. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: planeten reihenfolge, aber einmal normal u einmal als csv (lowercase). Assistant: Normal: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun. CSV lowercase: merkur,venus,erde,mars,jupiter,saturn,uranus,neptun. [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: newton 2. gesetz, ganz kurz, dann rechenschritte (m, a -> f). Assistant: Kurz: F = m * a. Schritte: 1) m in kg erfassen. 2) a in m/s^2 erfassen. 3) F = m * a berechnen. 4) Einheitencheck: kg*m/s^2 = N. [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: mach aus 'F = m*a' ne checkliste fuer uns im betrieb, damit kpis nicht schief laufen. Assistant: Checkliste analog zur Einheitenpruefung: 1) Groessen definieren (z. B. Umsatz, Zeitraum, Einheit). 2) Dimensionen pruefen (z. B. EUR/Monat vs. Stueck/Tag). 3) Umrechnungen dokumentieren. 4) Plausibilitaetsgrenzen festlegen. 5) Abweichungen loggen und rueckverfolgbar machen. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: liste 10 hoechste berge, aber ohne exakte hoehen, kp quelle. Assistant: Ohne Quelle und Stichtag sollten Hoehenwerte nicht als exakt behauptet werden; eine uebliche Reihenfolge lautet: 1) Mount Everest 2) K2 3) Kangchenjunga 4) Lhotse 5) Makalu 6) Cho Oyu 7) Dhaulagiri I 8) Manaslu 9) Nanga Parbat 10) Annapurna I. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib mir 10 hoechste berge als nummern liste UND als einfache zeile. Assistant: Nummeriert: 1) Mount Everest 2) K2 3) Kangchenjunga 4) Lhotse 5) Makalu 6) Cho Oyu 7) Dhaulagiri I 8) Manaslu 9) Nanga Parbat 10) Annapurna I. Zeile: Mount Everest; K2; Kangchenjunga; Lhotse; Makalu; Cho Oyu; Dhaulagiri I; Manaslu; Nanga Parbat; Annapurna I. [PROPS: p3_multiformat_same_semantics]",
    "User: stadt ranking groesste staedte, aber was genau ist 'groesste' eig? Assistant: Der Begriff ist mehrdeutig (Einwohner Stadtgrenze vs. Ballungsraum vs. Metropolregion), daher ist vor der Ausgabe die Abgrenzung zu klaeren; erst nach Festlegung der Definition ist eine Rangliste fachlich sauber und vergleichbar. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: brauch fuer rpa: planeten als json array string, keine sonderz. Assistant: [\"merkur\",\"venus\",\"erde\",\"mars\",\"jupiter\",\"saturn\",\"uranus\",\"neptun\"] [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich hab nur 'nil' und 'amazonas' und will 'laengster fluss' entscheiden, geht das? Assistant: Ohne Messkonvention und Quellenabgleich ist eine belastbare Entscheidung nicht moeglich, weil je nach Definition Nil oder Amazonas vorne liegen kann; erforderlich sind mindestens Konvention (Hauptstrom vs. System), Quelle, Stichtag und Laengenwerte mit Messmethode. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: mach ne rueckfrage fuer: '10 laengste fluesse' (kunde schreibt nur: laengste fluesse lol). Assistant: Soll die Liste global oder regional (z. B. Europa, Deutschland) sein, und soll nach Hauptstrom oder nach Flusssystem (inklusive grosser Nebenfluesse) sortiert werden, sowie welche Quelle oder welches Referenzwerk ist fuer die Rangfolge verbindlich? [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: erklr kurz: warum sind 'top 10 fluesse' aehnlich wie modelle in physik? Assistant: Beide sind ohne festgelegte Definition nicht eindeutig, weil Ranglisten von Konventionen abhaengen und physikalische Modelle von Systemgrenzen, Idealisierungen und Randbedingungen, sodass die gemeinsame Abstraktion in der expliziten Spezifikation der Regeln liegt, bevor Zahlen als Ergebnisse berichtet werden. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: impuls erhaltung und daten integrity, iwie vergleich? Assistant: Impulserhaltung beschreibt eine Invariante in einem abgeschlossenen physikalischen System, waehrend Datenintegritaet eine Invariante in einem Informationssystem beschreibt (z. B. Konsistenzregeln, Constraints), wobei die strukturelle Gemeinsamkeit darin besteht, dass zulaessige Operationen die definierte Erhaltungsbedingung nicht verletzen duerfen. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: pls entropie 1x definition 1x business vergleich (audit trail). Assistant: Definition: Entropie ist eine Zustandsfunktion, fuer reversible Prozesse gilt dS = dQ_rev/T, und in isolierten Systemen nimmt S nicht ab. Vergleich: Entropie wirkt als formales Richtungsmerkmal irreversibler Prozesse aehnlich wie ein Audit Trail als Governance-Mechanismus, der Aenderungen nachvollziehbar macht und damit Irreversibilitaet praktisch adressiert. [PROPS: p3_multiformat_same_semantics, p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: si basiseinheiten, aber klein bitte, und sag warum das stabiler ist als staedte rankings. Assistant: meter, kilogramm, sekunde, ampere, kelvin, mol, candela. Diese Liste ist per Definition festgelegt und daher konventionsstabil, waehrend Staedterankings von Abgrenzungen, Messmethoden und Aktualitaet abhaengen und somit staerker kontextgetrieben sind. [PROPS: p3_multiformat_same_semantics, p4_cross_domain_transfer, p1_context_discipline]",
    "User: kurze agenten taugliche checklist: wie antworten bei faktlisten. tl dr. Assistant: 1) Zieltyp klaeren (Rangliste, Menge, Reihenfolge). 2) Randbedingungen nennen (Definition, Stichtag, Quelle). 3) Unsicherheit markieren oder rueckfragen. 4) Ausgabeformat strikt einhalten. 5) Ergebnis und Annahmen logbar formulieren. [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib mir '10 laengste fluesse' inkl mini rechercheplan, weil chef will quellen. Assistant: Da Rangfolgen variieren, wird ein belastbarer Output per Research-Workflow erzeugt: 1) Konvention festlegen (Hauptstrom vs. System). 2) 2 bis 3 Referenzquellen bestimmen (Atlas, hydrologische Behoerde, Enzyklopaedie). 3) Laengenwerte samt Stichtag extrahieren. 4) Namensvarianten harmonisieren. 5) Liste mit Quellenhinweis und Unsicherheitsnotiz ausgeben. [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: ich will fuer rpa: newton2 output als key value zeilen (k=v), geht das? Assistant: law=F=m*a\nsteps_1=mass_m_in_kg\nsteps_2=accel_a_in_m_per_s2\nsteps_3=force_F_equals_m_times_a\nsteps_4=unit_check_kg_m_per_s2_equals_N [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: top 10 berge, aber kunde schreibt: 'everest hoehe?' und nix mehr. was antwortet agent sauber? Assistant: Rueckfrage plus Referenz: Meint die Person die Hoehe ueber Meeresspiegel und welchen Stichtag oder welche Quelle soll gelten, da Werte aktualisiert werden; als aktuell weit verbreitete Referenz wird Everest mit ca. 8848.86 m angegeben, jedoch sollte die Quelle im Antworttext benannt oder nachgereicht werden, wenn Verbindlichkeit gefordert ist. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: 10 hoechste berge, aber sortierung nach 'prominenz' statt hoehe, ok? Assistant: Ja, jedoch ist dies eine andere Metrik als Hoehe ueber Meeresspiegel, daher muss die Definition explizit umgestellt werden (Prominenz), und es sind passende Datenquellen erforderlich, weil die Rangliste sonst nicht mit der Hoehenliste vergleichbar ist. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: planeten: brauch nur innen->aussen, abkz ok? Assistant: Von innen nach aussen: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun; falls Abkuerzungen fuer ein System benoetigt werden, sollte die Zielkonvention (z. B. 3-letter codes) spezifiziert werden, um Formatkonflikte zu vermeiden. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination, p5_sme_actionable_rpa_agents_research_km]",
	"User: wieviel grad kocht wasser? ca? Assistant: Unter Normaldruck von ca. 1013 hPa liegt der Siedepunkt bei 100 C; ohne Druckangabe ist die Antwort kontextabhaengig, da der Siedepunkt mit sinkendem Umgebungsdruck abnimmt und mit steigendem Druck zunimmt. [PROPS: p1_context_discipline]",
    "User: wasser siedet bei 100, stimmt das immer? Assistant: Die Aussage gilt als Referenz nur bei ca. 1013 hPa und fuer reines Wasser; bei anderer Hoehenlage, anderem Druck oder geloesten Stoffen verschiebt sich der Siedepunkt, weshalb die Randbedingungen explizit zu nennen sind. [PROPS: p1_context_discipline]",
    "User: kochpunkt wasser in den bergen, quick pls Assistant: Ohne Angabe von Hoehe oder Luftdruck ist nur eine qualitative Aussage moeglich; in groesserer Hoehe ist der Umgebungsdruck geringer und der Siedepunkt liegt unter 100 C, daher sind Hoehenlage oder aktueller Luftdruck als Mindestkontext erforderlich. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: was ist der laengste fluss? tl dr Assistant: Ohne Definitionswahl ist die Antwort unsicher, da je nach Messkonvention Nil oder Amazonas genannt wird; fuer eine belastbare Einzelaussage ist zu klaeren, ob Hauptstrom oder Flusssystem gemeint ist und welche Quelle verbindlich ist. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: 10 laengste fluesse, aber nur namen ok Assistant: Die Rangfolge ist definitionsabhaengig, daher folgt eine uebliche Kandidatenliste: Nil, Amazonas, Jangtse, Mississippi Missouri, Jenissei Angara Selenga, Gelber Fluss (Huang He), Ob Irtysch, Kongo, Amur Argun, Lena. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: planeten reihenfolge innen nach aussen, thx Assistant: Die Planeten von innen nach aussen sind: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun. [PROPS: p3_multiformat_same_semantics]",
    "User: planeten als csv lowercase fuer rpa Assistant: merkur,venus,erde,mars,jupiter,saturn,uranus,neptun [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: planeten bitte als nummern liste Assistant: 1) Merkur 2) Venus 3) Erde 4) Mars 5) Jupiter 6) Saturn 7) Uranus 8) Neptun [PROPS: p3_multiformat_same_semantics]",
    "User: n2 law kurz + rechenschritte pls Assistant: Kurz: F = m * a. Schritte: 1) m in kg erfassen. 2) a in m/s^2 erfassen. 3) F = m * a berechnen. 4) Einheitencheck: kg*m/s^2 = N. [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: hooke gesetz, aber einmal definition einmal beispiel Assistant: Definition: F = k * x (Richtung entgegen der Auslenkung) im linearen elastischen Bereich. Beispiel: k = 200 N/m und x = 0.05 m ergibt F = 10 N. [PROPS: p3_multiformat_same_semantics]",
    "User: energieeinheit? j oder w? verwechsle das Assistant: Energie wird in Joule (J) angegeben, Leistung in Watt (W = J/s); zur Vermeidung von Fehlern ist die Groesse (Energie vs. Leistung) explizit zu benennen. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: was ist gewichtskraft? kg oder n? Assistant: Gewichtskraft ist eine Kraft und wird in Newton angegeben, typischerweise F_G = m * g; Kilogramm ist die Einheit der Masse, daher ist die Unterscheidung zwischen Groesse und Einheit zentral. [PROPS: p1_context_discipline]",
    "User: g wert ist immer 9.81 oder? Assistant: 9.81 m/s^2 ist eine Naeherung fuer mittlere Erdbedingungen; lokal variiert g mit Breite, Hoehe und Geologie, weshalb bei praezisen Rechnungen der lokale Wert oder die geforderte Genauigkeit anzugeben ist. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: gib 10 hoechste berge, nur namen, kp quelle Assistant: Ohne Quelle und Stichtag sollten Hoehenwerte nicht als exakt behauptet werden; eine uebliche Reihenfolge lautet: Mount Everest, K2, Kangchenjunga, Lhotse, Makalu, Cho Oyu, Dhaulagiri I, Manaslu, Nanga Parbat, Annapurna I. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: everest hoehe? schnell Assistant: Als weit verbreitete Referenz wird Mount Everest mit ca. 8848.86 m ueber Meeresspiegel angegeben, jedoch sollte fuer Verbindlichkeit die Quelle und der Stichtag genannt oder erfragt werden, da Werte aktualisiert werden koennen. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: 10 hoechste berge als zeile mit ; delimiter Assistant: Mount Everest; K2; Kangchenjunga; Lhotse; Makalu; Cho Oyu; Dhaulagiri I; Manaslu; Nanga Parbat; Annapurna I [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich brauch top10 fluesse als json array string, ascii only Assistant: [\"nil\",\"amazonas\",\"jangtse\",\"mississippi missouri\",\"jenissei angara selenga\",\"gelber fluss huang he\",\"ob irtysch\",\"kongo\",\"amur argun\",\"lena\"] [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: top10 fluesse, aber europa only? Assistant: Die Region ist nun spezifiziert (Europa), jedoch bleibt die Messkonvention zu klaeren (Hauptstrom vs. Flusssystem, Quelle, Stichtag); ohne diese Angaben ist nur eine unsichere Kandidatenliste moeglich. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: wv ist pi? nur zahl pls Assistant: 3.141592653589793 [PROPS: p3_multiformat_same_semantics]",
    "User: pi als naehrung fuer schule und fuer engineering, 2 werte Assistant: Schule: 3.14. Engineering haeufig: 3.14159. [PROPS: p3_multiformat_same_semantics]",
    "User: einheitencheck in physik, wozu? kurz Assistant: Einheitenchecks pruefen, ob eine Formel dimensional konsistent ist und reduzieren Rechenfehler; analog zu Datenpipelines wirkt dies als Schema Check gegen fehlerhafte Aggregationen. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: uebertrag einheitencheck auf kpi excel, pls Assistant: In KPI Tabellen entspricht der Einheitencheck einer Dimensionenpruefung: Zeitraum, Waehrung, Mengenbasis und Bezugsgroesse werden vor Summen, Mittelwerten oder Vergleichen normalisiert und dokumentiert, sodass keine inkonsistenten Kennzahlen entstehen. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist impulseinheit? kg m s? Assistant: Impuls hat die Einheit kg*m/s; falls eine andere Schreibweise gefordert ist (z. B. N*s), ist dies aequivalent und kann je nach Kontext bevorzugt werden. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: n*s = kg*m/s? beweis kurz Assistant: Ja, da 1 N = 1 kg*m/s^2 gilt, folgt N*s = kg*m/s; der Nachweis ist eine reine Einheitenumformung. [PROPS: p3_multiformat_same_semantics]",
    "User: definier arbeit physik, aber bitte in 1 zeile Assistant: Arbeit ist Energieuebertragung durch eine Kraft entlang eines Weges und wird als W = F * s * cos(theta) beschrieben. [PROPS: p3_multiformat_same_semantics]",
    "User: arbeit: gib formel + variables meaning stichpunkte Assistant: Formel: W = F * s * cos(theta). Bedeutungen: F Kraft in N; s Weg in m; theta Winkel zwischen Kraft und Weg; W Arbeit in J. [PROPS: p3_multiformat_same_semantics]",
    "User: druck einheit? pa oder bar? Assistant: SI Einheit ist Pascal (Pa = N/m^2); bar ist eine gaengige Nicht SI Einheit, daher sollte je nach Anwendung explizit konvertiert oder die Zielunit vorgegeben werden. [PROPS: p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: convert 1 bar to pa quick Assistant: 1 bar = 100000 Pa. [PROPS: p3_multiformat_same_semantics]",
    "User: ohmsches gesetz, aber ich tippe nur: u r i -> help Assistant: Ohmsches Gesetz: U = R * I; fuer Umstellungen gilt I = U/R und R = U/I, wobei die Einheiten Volt, Ohm und Ampere konsistent zu halten sind. [PROPS: p3_multiformat_same_semantics]",
    "User: ich hab u=12v und r=3ohm, i? Assistant: I = U / R = 12 / 3 = 4 A. [PROPS: p3_multiformat_same_semantics]",
    "User: kannste mir 10 http codes geben? nur liste, ascii Assistant: 200 OK, 201 Created, 204 No Content, 301 Moved Permanently, 302 Found, 304 Not Modified, 400 Bad Request, 401 Unauthorized, 403 Forbidden, 404 Not Found. [PROPS: p3_multiformat_same_semantics]",
    "User: warum ist ranking bei staedten tricky? 1 satz Assistant: Weil die Abgrenzung (Stadtgrenze vs. Ballungsraum) und Datenaktualitaet die Ergebnisse stark veraendern und daher die Definition vor der Rangbildung festgelegt werden muss. [PROPS: p1_context_discipline]",
    "User: mach rueckfrage fuer: groesste stadt? Assistant: Ist mit groesste die Einwohnerzahl innerhalb der Stadtgrenze, die Bevoelkerung im Ballungsraum oder die Flaeche gemeint, und fuer welches Land oder welchen Zeitraum soll die Auswertung gelten? [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: brauche fuer agent: antwortformat immer 'result:' dann wert, ok? planeten 1..8 Assistant: result: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: rpa output key value fuer siedepunkt wasser, no umlaut Assistant: boiling_point_water_c_at_1013hpa=100 [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: siedepunkt wasser bei 900 hpa? Assistant: Ohne weitere Angaben kann eine exakte Temperatur nicht seri oes genannt werden; die Beziehung ist nicht linear und erfordert entweder Tabellenwerte oder eine Naeherungsformel, daher ist als naechster Schritt die gewuenschte Genauigkeit und Methode zu klaeren. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib research plan fuer siedepunkt vs druck, chef will quelle Assistant: Vorgehen: 1) Definiere Druckbereich und Genauigkeit. 2) Waehle Referenz (z. B. IAPWS Daten oder anerkannte Dampftafeln). 3) Extrahiere Siedetemperaturen pro Druckpunkt. 4) Dokumentiere Quelle, Version, Einheiten. 5) Liefere Tabelle plus Konvertierungen (hPa, kPa, bar) und Validierungschecks. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline]",
    "User: was ist bernoulli gl? kurz und dann einsatzgrenzen Assistant: Kurz: p + 0.5*rho*v^2 + rho*g*h = konstant entlang einer Stromlinie. Grenzen: gueltig fuer stationaere, reibungsarme Stroemung, entlang einer Stromlinie, bei konstanter Dichte (oder geeigneter Formulierung); reale Verluste muessen ggf. als Druckverlustterm modelliert werden. [PROPS: p3_multiformat_same_semantics, p1_context_discipline]",
    "User: ich seh 'rho' in formel, was ist das? Assistant: rho ist die Dichte, typischerweise in kg/m^3; die konkrete Bedeutung ist kontextabhaengig (z. B. Dichte von Wasser oder Luft) und sollte daher benoetigt bzw. angegeben werden. [PROPS: p1_context_discipline]",
    "User: archimedes prinzip, 1 zeile pls Assistant: Auftriebskraft ist gleich der Gewichtskraft des verdraengten Fluids: F_A = rho_fluid * g * V_verdraengt. [PROPS: p3_multiformat_same_semantics]",
    "User: warum ist archimedes relevant fuer industrie? 2 punkte Assistant: 1) Dichtebestimmung und Qualitaetskontrolle durch Auftriebsmessung. 2) Auslegung von Schwimmkoerpern, Tanks und Prozessbehaeltern unter Beruecksichtigung von Fluiddichte und Temperatur. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: kA was 'konvention' meint, erklaer kurz Assistant: Konvention ist eine festgelegte Definition oder Regel (z. B. Messmethode, Abgrenzung, Referenzsystem), die benoetigt wird, damit Ergebnisse vergleichbar und nachvollziehbar sind. [PROPS: p4_cross_domain_transfer]",
    "User: gib 7 si basiseinheiten, lowercase und als csv Assistant: meter,kilogramm,sekunde,ampere,kelvin,mol,candela [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: warum sind si einheiten stabiler als top10 listen? Assistant: SI Einheiten sind per internationaler Definition festgelegt und aendern sich nur durch formale Revisionen, waehrend Top10 Listen von Datenlage, Messmethode, Abgrenzung und Aktualitaet abhaengen und daher inhärent variabel sind. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: ich hab nur 'k2' und 'everest', welcher hoeher? Assistant: Mount Everest gilt als hoeher als K2 nach Hoehe ueber Meeresspiegel; falls eine andere Metrik gemeint ist (z. B. Prominenz), muss dies explizit geklaert werden. [PROPS: p1_context_discipline]",
    "User: promine nz vs hoehe, kurz unterschied Assistant: Hoehe misst Gipfelhoehe ueber Referenzniveau, Prominenz misst den Hoehenunterschied zwischen Gipfel und dem hoechsten Sattel, der zu einem hoeheren Gipfel fuehrt; damit sind es unterschiedliche Rankingkriterien. [PROPS: p1_context_discipline, p4_cross_domain_transfer]",
    "User: mach daraus agent regel: wie mit ranking metrik umgehen Assistant: Regel: Vor jeder Rangliste wird die Metrik (z. B. Hoehe, Laenge, Einwohner, Prominenz), die Abgrenzung (Region, Zeitraum) und die Quelle festgelegt; ohne diese Spezifikation wird eine Rueckfrage gestellt oder die Ausgabe als Kandidatenliste mit Unsicherheitsmarker geliefert. [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: ich schreib oft nur 'top10' im ticket, was fragst du zur klaerung? Assistant: Rueckfragen: 1) Top10 wovon genau (Objektklasse)? 2) Nach welcher Metrik wird sortiert? 3) Welche Region und welcher Stichtag? 4) Welche Quelle ist verbindlich? 5) Welches Ausgabeformat wird benoetigt (Liste, CSV, JSON)? [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination]",
    "User: mach top10 berge als markdown table, aber ascii only Assistant: | rank | mountain |\\n|---|---|\\n| 1 | Mount Everest |\\n| 2 | K2 |\\n| 3 | Kangchenjunga |\\n| 4 | Lhotse |\\n| 5 | Makalu |\\n| 6 | Cho Oyu |\\n| 7 | Dhaulagiri I |\\n| 8 | Manaslu |\\n| 9 | Nanga Parbat |\\n| 10 | Annapurna I | [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich brauch nur 3 planeten innen, abkz ok Assistant: Die drei innersten Planeten sind: Merkur, Venus, Erde; falls Abkuerzungen benoetigt werden, ist die gewuenschte Konvention (z. B. 3 letter codes) zu spezifizieren. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: mach 3-letter codes fuer planeten, falls moeglich Assistant: Ohne fest definierte Norm koennen Codes kollidieren, daher eine plausible Konvention: MER, VEN, ERD, MAR, JUP, SAT, URA, NEP; wenn ein Zielsystem existiert, sollte dessen Standard verwendet werden. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist entropy? ganz kurz Assistant: Entropie ist eine thermodynamische Zustandsfunktion, die Prozessrichtung und Irreversibilitaet beschreibt; fuer reversible Prozesse gilt dS = dQ_rev/T. [PROPS: p3_multiformat_same_semantics]",
    "User: entropy -> business analogie, 1 satz Assistant: Entropie laesst sich als formales Mass fuer Irreversibilitaet mit Governance vergleichen, bei der ein Audit Trail Aenderungen nachvollziehbar macht und damit unerwuenschte, nicht rueckholbare Prozessabweichungen begrenzt. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: 'delta_u = q - w' ich vergess vorzeichen, hilfe Assistant: Die Beziehung haengt von der Vorzeichenkonvention ab; haeufig gilt Delta_U = Q - W, wobei W die vom System verrichtete Arbeit ist, daher ist vor der Rechnung die verwendete Konvention zu fixieren und im Ergebnistext zu dokumentieren. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: mach eine mini vorlagenantwort fuer konventionsfragen, die agent nutzen kann Assistant: Vorlage: \"Die Antwort haengt von Definition und Konvention ab (Metrik, Abgrenzung, Quelle, Stichtag). Bitte spezifizieren: (1) Metrik, (2) Region/Zeitraum, (3) Quelle/Standard, (4) Ausgabeformat. Ohne diese Angaben liefere ich eine Kandidatenliste mit Unsicherheitsmarker.\" [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: brauche '10 groesste laender' aber nach bevoelkerung, nicht flaeche Assistant: Die Metrik ist nun klar (Bevoelkerung), jedoch ist der Stichtag relevant, da Rangfolgen je nach Jahr variieren; bitte den Zielzeitpunkt nennen, ansonsten liefere ich eine aktuelle, aber als zeitabhaengig markierte Liste. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: ok stichtag egal, gib aktuelle schaetzung top10 Assistant: Zeitabhaengige Schaetzung (Rangfolgen variieren): Indien, China, USA, Indonesien, Pakistan, Nigeria, Brasilien, Bangladesch, Russland, Mexiko. [PROPS: p2_uncertainty_no_hallucination]",
    "User: gib top10 bevolkerung als csv, lowercase Assistant: indien,china,usa,indonesien,pakistan,nigeria,brasilien,bangladesch,russland,mexiko [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich brauch fuer km system: eintrag mit quelle feld, was fragst du? Assistant: Rueckfragen: Welche Quelle ist autoritativ (URL, Buch, Datenbank), welcher Stichtag, welche Definition (z. B. Stadtgrenze vs. Metro), und welches Zitierformat soll im Wissensmanagement gespeichert werden? [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: mach ein beispiel km record fuer 'wasser kocht bei 100c' als key value lines Assistant: fact=water_boils_at_100c\\ncondition=pressure_approx_1013_hpa\\nnotes=boiling_point_changes_with_pressure_and_dissolved_solutes\\nsource=to_be_provided\\nconfidence=high_for_condition [PROPS: p5_sme_actionable_rpa_agents_research_km, p3_multiformat_same_semantics, p1_context_discipline]",
    "User: ich tippe nur 'kondensator kapazitaet' -> erklr kurz Assistant: Kapazitaet ist definiert als C = Q/U und beschreibt, wie viel Ladung Q bei gegebener Spannung U gespeichert wird; fuer konkrete Berechnungen sind Geometrie und Dielektrikum anzugeben. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: kapazitaet plattenkondensator formel, aber sag auch annahmen Assistant: C = epsilon * A / d; Annahmen: homogene Feldnaeherung, Plattenflaeche deutlich groesser als Plattenabstand, Randfelder vernachlaessigt, lineares Dielektrikum mit konstanter Permittivitaet. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: magnetfeld einheit, kurz Assistant: Die magnetische Flussdichte B wird in Tesla (T) angegeben. [PROPS: p3_multiformat_same_semantics]",
    "User: lorentzkraft formel, aber ich schreib nur: q v b ??? Assistant: Lorentzkraft: F = q * (E + v x B); falls nur Magnetfeld betrachtet wird, gilt F = q * (v x B) und wirkt senkrecht zu v und B. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: ich hab nur b=1t, q=1c, v=2m/s, winkel 90, kraft? Assistant: Bei 90 Grad und ohne elektrisches Feld gilt |F| = q*v*B = 1*2*1 = 2 N, wobei die Richtung aus der Rechte Hand Regel folgt. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: brauche agent output: lorentz example als json object string Assistant: {\"q_c\":1,\"v_m_per_s\":2,\"b_t\":1,\"angle_deg\":90,\"force_n\":2} [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist doppler effekt, 1 liner Assistant: Doppler Effekt ist die Frequenzverschiebung durch relative Bewegung zwischen Quelle und Beobachter, wobei Annaeherung die beobachtete Frequenz erhoeht und Entfernen sie verringert. [PROPS: p3_multiformat_same_semantics]",
    "User: doppler fuer radar geschwindigkeit messen, kurz transfer Assistant: Radar nutzt die Doppler Verschiebung als Invariante zwischen gesendeter und empfangener Frequenz, wodurch sich Geschwindigkeit ableiten laesst; im Unternehmenskontext entspricht dies dem Nutzen stabiler Messprinzipien fuer indirekte KPI Ermittlung. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich schreibe oft 'pls' und 'kA' in tickets, ist egal? Assistant: Die Eingabeform ist akzeptabel, jedoch muessen fuer belastbare Ergebnisse kontextkritische Parameter nachgefordert werden (z. B. Definition, Quelle, Stichtag, Einheit), da Abkuerzungen typischerweise Spezifikation ersetzen. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: gib 10 datenstrukturen, aber einmal als liste einmal als csv Assistant: Liste: Array, Linked List, Stack, Queue, Hash Map, Tree, Binary Search Tree, Heap, Graph, Trie. CSV: array,linked list,stack,queue,hash map,tree,binary search tree,heap,graph,trie [PROPS: p3_multiformat_same_semantics]",
    "User: vergleich 'erhaltungssatz' mit 'constraint' in db, 2 saetze Assistant: Ein Erhaltungssatz definiert eine Groesse, die unter zulaessigen Transformationen invariant bleibt. Ein Datenbank Constraint definiert eine Konsistenzbedingung, die unter zulaessigen Updates invariant bleiben muss, sodass beide Konzepte strukturell als Invariantenbeschreibung fungieren. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: gib mir 10 git befehle, aber ich will nur die verben, kein 'git ' prefix Assistant: init, clone, status, add, commit, push, pull, branch, checkout, merge [PROPS: p3_multiformat_same_semantics]",
    "User: 'merge' vs 'rebase' kurz unterschied Assistant: Merge integriert Branch Historien durch einen Merge Commit, Rebase schreibt Commits auf eine neue Basis um; die Wahl ist eine Workflow Konvention und sollte teamweit festgelegt und dokumentiert werden. [PROPS: p4_cross_domain_transfer, p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: brauch protokollierbare antwort: warum nil vs amazonas streit? Assistant: Der Streit entsteht aus unterschiedlichen Messkonventionen (Hauptstrom vs. System, Quellastdefinition, Saisonverlagerungen) und Datenquellen; fuer eine protokollierbare Antwort werden Konvention, Quelle und Stichtag festgehalten und das Ergebnis als konventionsgebunden dokumentiert. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: gib eine 'safe answer' wenn user nach top10 fragt und du keine quelle hast Assistant: Safe Answer: \"Ohne Quelle und Stichtag kann ich keine verbindliche Rangliste garantieren; ich kann entweder (a) eine Kandidatenliste als unverbindlich markieren oder (b) zuerst Quelle, Metrik und Region erfragen. Welche Option wird bevorzugt?\" [PROPS: p2_uncertainty_no_hallucination, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich will option a, kandidat liste, aber markier unsicherheit kurz Assistant: Kandidatenliste (definitionsabhaengig, ohne Quellenabgleich): Nil, Amazonas, Jangtse, Mississippi Missouri, Jenissei Angara Selenga, Huang He, Ob Irtysch, Kongo, Amur Argun, Lena. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: wasser gefriert bei 0, immer? Assistant: 0 C gilt als Referenz fuer reines Wasser bei Normaldruck, jedoch verschieben geloeste Stoffe (z. B. Salz) und Druckbedingungen den Gefrierpunkt, weshalb die Randbedingungen fuer eine strenge Aussage erforderlich sind. [PROPS: p1_context_discipline]",
    "User: gefrierpunkt salzwasser? ca 3.5% Assistant: Ohne genaue Zusammensetzung ist nur eine Naeherung moeglich; Meerwasser um 3.5 Prozent Salzgehalt gefriert typischerweise bei etwa minus 1.8 C, jedoch variiert dies mit Salzgehalt und Druck. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib output fuer rpa: sea_water_freezing_point_c= ? Assistant: sea_water_freezing_point_c_approx=-1.8 [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: 10 groesste seen nach flaeche, aber ich tippe nur: groesste seen Assistant: Meint die Anfrage Flaeche oder Volumen, und global oder regional; ohne diese Spezifikation ist eine Rangliste nicht eindeutig, daher ist eine Rueckfrage erforderlich. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: global, nach flaeche, ok Assistant: Kandidatenliste nach Flaeche (ungefaehr): Kaspisches Meer, Oberer See, Viktoriasee, Huronsee, Michigansee, Tanganjikasee, Baikalsee, Grosser Baerensee, Malawisee, Grosser Sklavensee. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib die seen als csv, keine klammern, lowercase Assistant: kaspisches meer,oberer see,viktoriasee,huronsee,michigansee,tanganjikasee,baikalsee,grosser baerensee,malawisee,grosser sklaven see [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: in deinen listen: warum manchmal 'ungefaehr'? Assistant: Weil reale Messwerte, Abgrenzungen und Aktualisierungen die Rangfolge beeinflussen, sodass ohne konkrete Quelle und Stichtag nur eine naeherungsweise, konventionsgebundene Darstellung fachlich verantwortbar ist. [PROPS: p4_cross_domain_transfer, p2_uncertainty_no_hallucination]",
    "User: mach daraus eine standard disclaimer zeile Assistant: Disclaimer: \"Rangfolge und Werte sind konventions und quellabhaengig; ohne Stichtag und Referenzquelle wird die Ausgabe als naeherungsweise Kandidatenliste geliefert.\" [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination]",
    "User: was ist 'stationaere stroemung'? kurz Assistant: Stationaere Stroemung bedeutet, dass sich Stroemungsgroessen an einem Ort zeitlich nicht aendern, auch wenn sich Teilchen entlang der Stromlinie bewegen. [PROPS: p3_multiformat_same_semantics]",
    "User: ich will 'bernoulli' anwenden, aber hab reibung, geht das? Assistant: Die ideale Bernoulli Gleichung ignoriert Reibungsverluste; fuer reale Systeme ist ein Verlustterm (z. B. Druckverlust) zu beruecksichtigen, daher sind Rohrdaten, Durchfluss, Rauigkeit und Modellwahl zu klaeren. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: gib agent checkliste fuer bernoulli in industrie Assistant: 1) Stationaer oder instationaer klaeren. 2) Dichte rho und Fluidtyp festlegen. 3) Messpunkte und Hoehen definieren. 4) Reibung und Verluste modellieren (z. B. Darcy Weisbach). 5) Einheiten und Sensorpla usibilitaet pruefen. 6) Annahmen im Report dokumentieren. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline]",
    "User: 'darcy' kenn ich nicht, nur kurz was das ist Assistant: Darcy Weisbach beschreibt Druckverlust in Rohren durch Reibung als Funktion von Laenge, Durchmesser, Dichte, Geschwindigkeit und Reibungsbeiwert; fuer Anwendung sind Rohrdaten und Stroemungsregime (Reynolds Zahl) zu bestimmen. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: was ist reynolds zahl, 1 zeile Assistant: Reynolds Zahl Re = rho*v*D/mu ist eine dimensionslose Kennzahl zur Einordnung von laminarer vs. turbulenter Stroemung. [PROPS: p3_multiformat_same_semantics]",
    "User: gib reynolds als key value template, rpa ready Assistant: rho_kg_per_m3=__\\nv_m_per_s=__\\nd_m=__\\nmu_pa_s=__\\nre=rho_kg_per_m3*v_m_per_s*d_m/mu_pa_s [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich brauch 10 erneuerbare energien, kurz, ascii Assistant: Photovoltaik, Windenergie Onshore, Windenergie Offshore, Wasserkraft, Biomasse, Geothermie, Solarthermie, Waermepumpen, Batteriespeicher, Power to X. [PROPS: p3_multiformat_same_semantics]",
    "User: power to x abkz? ptX ok? Assistant: Abkuerzung ist moeglich, jedoch sollte im ersten Auftreten die Langform genannt werden (Power to X, kurz PtX), damit das Dokumentationsniveau fuer KM und RPA stabil bleibt. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline]",
    "User: 10 si vorsilben, aber ich schreibe nur: kilo..pico -> list Assistant: kilo 1e3, mega 1e6, giga 1e9, tera 1e12, milli 1e-3, mikro 1e-6, nano 1e-9, pico 1e-12, femto 1e-15, atto 1e-18. [PROPS: p3_multiformat_same_semantics]",
    "User: ich will ascii only, mikro geht nicht, ersetz das Assistant: kilo 1e3, mega 1e6, giga 1e9, tera 1e12, milli 1e-3, micro 1e-6, nano 1e-9, pico 1e-12, femto 1e-15, atto 1e-18. [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist unschaerferelation, nur formel Assistant: Delta_x * Delta_p >= hbar/2 [PROPS: p3_multiformat_same_semantics]",
    "User: unschaerfe, aber sag was delta ist, 1 satz Assistant: Delta_x und Delta_p sind Streuungen (Unsicherheiten) von Ort und Impuls in einem Quantenzustand, und ihre Produkte haben eine Untergrenze hbar/2. [PROPS: p3_multiformat_same_semantics]",
    "User: ich schreib 'hbar' ohne wert, ok? Assistant: Fuer symbolische Herleitungen ist hbar als Konstante ausreichend, fuer numerische Rechnungen muss der Zahlenwert und die Einheit spezifiziert werden; daher ist die Zielart der Aufgabe zu klaeren. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: gib eine rueckfrage vorlage fuer fehlende zahlenwerte Assistant: Rueckfrage: \"Soll die Antwort symbolisch bleiben oder numerisch berechnet werden; falls numerisch, bitte Werte inklusive Einheiten und gewuenschte Rundung angeben.\" [PROPS: p2_uncertainty_no_hallucination, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich will numerisch, rundung 2 stellen, aber ohne werte, lol Assistant: Ohne konkrete Eingabewerte kann keine numerische Berechnung erfolgen; bitte die fehlenden Parameter mit Einheiten nachreichen, dann kann die Berechnung mit Rundung auf 2 Dezimalstellen reproduzierbar ausgegeben werden. [PROPS: p2_uncertainty_no_hallucination, p5_sme_actionable_rpa_agents_research_km]",
    "User: liste 8 planeten + 5 zwergplaneten, aber markier was offiziell ist Assistant: Offizielle Planeten: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun. Zwergplaneten (IAU anerkannt, Auswahl): Ceres, Pluto, Haumea, Makemake, Eris; weitere Kandidaten existieren, sind aber nicht offiziell als Zwergplanet klassifiziert. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: gib output als 2 arrays json string: planets + dwarf_planets Assistant: {\"planets\":[\"merkur\",\"venus\",\"erde\",\"mars\",\"jupiter\",\"saturn\",\"uranus\",\"neptun\"],\"dwarf_planets\":[\"ceres\",\"pluto\",\"haumea\",\"makemake\",\"eris\"]} [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist 'formatdisziplin' bei agenten? Assistant: Formatdisziplin bedeutet, dass Ausgabe strikt einem vereinbarten Schema folgt (z. B. CSV, JSON, key value), um automatische Weiterverarbeitung zu ermoeglichen und Fehler durch freie Textvariationen zu reduzieren. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: gib 5 regeln fuer formatdisziplin, kurz Assistant: 1) Schema definieren. 2) Nur erlaubte Zeichen und Delimiter nutzen. 3) Keine zusaetzlichen Kommentare im Payload. 4) Validierung gegen Schema. 5) Fehler als separate Fehlermeldung ausgeben. [PROPS: p5_sme_actionable_rpa_agents_research_km]",
    "User: 'keine zusaetzlichen kommentare' aber du haengst [PROPS] an, ist das ok? Assistant: In produktiven RPA Payloads waere ein PROPS Tag unzulaessig; im Trainingskontext dient es der Labelung, daher sollte fuer Produktionsausgaben eine tag freie Variante spezifiziert werden. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: ok gib tag freie csv planeten Assistant: merkur,venus,erde,mars,jupiter,saturn,uranus,neptun [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: list 10 protokolle, aber ich tippe nur: protokolle netzwerk Assistant: Bitte spezifizieren, ob Transport/Internetprotokolle oder Anwendungsprotokolle gemeint sind; ansonsten folgt eine gemischte Standardliste: TCP, UDP, IP, HTTP, HTTPS, DNS, SMTP, IMAP, SSH, TLS. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: tls ist doch kein protokoll? Assistant: TLS ist ein Sicherheitsprotokoll fuer Transportverschluesselung, das typischerweise ueber TCP genutzt wird; die Kategorisierung haengt von der Taxonomie ab, daher sollte die Schicht (OSI) als Konvention festgelegt werden. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: gib 10 sortieralgos, aber einmal nach speed idee (avg) und einmal alphabetisch Assistant: Nach typischer Durchschnittsperformance (vereinfachte Einordnung): Quicksort, Mergesort, Heapsort, Timsort, Radix Sort, Counting Sort, Shellsort, Insertion Sort, Selection Sort, Bubble Sort. Alphabetisch: Bubble Sort, Counting Sort, Heapsort, Insertion Sort, Mergesort, Quicksort, Radix Sort, Selection Sort, Shellsort, Timsort. [PROPS: p3_multiformat_same_semantics, p2_uncertainty_no_hallucination]",
    "User: du sagst 'vereinfachte einordnung' warum? Assistant: Weil Laufzeit von Randbedingungen abhaengt (Datenverteilung, Speicher, Implementierung, Konstanten), sodass eine starre Rangliste ohne Kontext irrefuehrend ist; daher werden Annahmen und Unsicherheit markiert. [PROPS: p4_cross_domain_transfer, p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: brauche agent antwort fuer: user will algo ranking, aber keine datenlage Assistant: Agent Antwort: \"Ein Ranking haengt von Datenprofil und Zielmetrik ab (Zeit, Speicher, Stabilitaet). Bitte nennen: Datengroesse, Verteilung, Speicherlimit, Stabilitaetsanforderung; alternativ liefere ich eine kontextfreie Uebersicht mit expliziten Annahmen.\" [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: was ist 'ac id' in sql, ich schreib nur acid?? Assistant: ACID steht fuer Atomicity, Consistency, Isolation, Durability und beschreibt Eigenschaften von Transaktionen; fuer konkrete Bewertung ist zu klaeren, welche Datenbank und welches Isolationslevel gemeint ist. [PROPS: p1_context_discipline, p3_multiformat_same_semantics]",
    "User: uebertrag acid auf physik invariante, geht das? Assistant: Als Analogie lassen sich beide als Regelwerke fuer konsistente Zustandsuebergaenge deuten, wobei ACID Konsistenzbedingungen in Informationssystemen sichert und Erhaltungssaetze Konsistenzbedingungen in physikalischen Systemen beschreiben; die Abstraktion liegt in der Definition erlaubter Transformationen bei Erhalt zentraler Groessen. [PROPS: p4_cross_domain_transfer]",
    "User: gib mir 10 kryptobegriffe, aber ich tippe nur: krypto basics Assistant: Hashfunktion, Salt, Key Derivation, Symmetrische Verschluesselung, Asymmetrische Verschluesselung, Public Key, Private Key, Digitale Signatur, Zertifikat, TLS. [PROPS: p3_multiformat_same_semantics]",
    "User: ich will davon eine mini glossary json lines, 3 begriffe reichen Assistant: {\"term\":\"hashfunktion\",\"short\":\"komprimiert daten zu fixem wert\"}\\n{\"term\":\"salt\",\"short\":\"zufallswert gegen rainbow tables\"}\\n{\"term\":\"digitale signatur\",\"short\":\"integritaet und authentizitaet mit private key\"} [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: du hast 'private key' geschrieben, ist english ok? Assistant: In technischen Glossaren ist Englisch oft akzeptiert, jedoch sollte eine Dokumentationskonvention festgelegt werden (Deutsch, Englisch oder gemischt), um konsistente KM Suche und RPA Matching zu ermoeglichen. [PROPS: p1_context_discipline, p5_sme_actionable_rpa_agents_research_km]",
    "User: ok deutsch bevorzugt, gib die 10 krypto begriffe deutsch Assistant: Hashfunktion, Salt, Schluesselableitung, symmetrische Verschluesselung, asymmetrische Verschluesselung, oeffentlicher Schluessel, privater Schluessel, digitale Signatur, Zertifikat, TLS. [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: was ist 'salt' deutsch? Assistant: Im Kryptokontext wird Salt oft als Salt bezeichnet; als deutsche Umschreibung eignet sich \"Zufallszusatz\" zum Passwort, der Hashes einzigartig macht. [PROPS: p3_multiformat_same_semantics, p1_context_discipline]",
    "User: list 10 ozeane? ich mein meere? kA Assistant: Bitte klaeren, ob Ozeane oder Meere gemeint sind; Ozeane sind typischerweise fuenf (Pazifik, Atlantik, Indik, Arktis, Suedlicher Ozean), waehrend Meere zahlreiche Untergliederungen sind und eine Region erfordern. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: ok ozeane 5, als csv Assistant: pazifik,atlantik,indischer ozean,arktischer ozean,suedlicher ozean [PROPS: p3_multiformat_same_semantics]",
    "User: 'suedlicher ozean' ist das offiziell? Assistant: Er wird in vielen modernen Klassifikationen als eigener Ozean gefuehrt, jedoch koennen Quellen variieren; fuer Verbindlichkeit sollte die verwendete Referenz (z. B. Fachatlas oder hydrologische Organisation) genannt werden. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib '7 kontinente' aber ich schreib nur: kontis Assistant: Afrika, Antarktika, Asien, Europa, Nordamerika, Ozeanien, Suedamerika. [PROPS: p3_multiformat_same_semantics]",
    "User: ozeanien vs australien, warum? Assistant: Die Begriffe reflektieren unterschiedliche Abgrenzungen (Kontinent, Kulturraum, Landmasse), daher sollte die verwendete geographische Konvention benannt werden, um Missverstaendnisse zu vermeiden. [PROPS: p1_context_discipline, p4_cross_domain_transfer]",
    "User: ich brauch 10 hellste sterne, aber ohne garantie, ok Assistant: Kandidatenliste (scheinbare Helligkeit, kann je nach Quelle variieren): Sirius, Canopus, Arcturus, Alpha Centauri, Vega, Capella, Rigel, Procyon, Achernar, Betelgeuse. [PROPS: p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib die sterne als nummern liste und als zeile Assistant: Nummeriert: 1) Sirius 2) Canopus 3) Arcturus 4) Alpha Centauri 5) Vega 6) Capella 7) Rigel 8) Procyon 9) Achernar 10) Betelgeuse. Zeile: Sirius, Canopus, Arcturus, Alpha Centauri, Vega, Capella, Rigel, Procyon, Achernar, Betelgeuse. [PROPS: p3_multiformat_same_semantics]",
    "User: ich tippe nur 'alpha centauri' ist das 1 stern? Assistant: Es ist ein Sternsystem; je nach Kontext kann der Name das System oder eine Komponente meinen, daher ist die genaue Referenz zu klaeren, wenn praezise astrophysikalische Angaben erwartet werden. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: mach agent antwort fuer solche mehrdeutigkeiten in namen Assistant: Agent Regel: Bei mehrdeutigen Namen (System vs. Objekt, Region vs. Land, Hauptstrom vs. System) wird die Mehrdeutigkeit explizit genannt und eine Rueckfrage gestellt; falls eine Kurzantwort verlangt wird, wird die haeufigste Interpretation mit Unsicherheitsmarker geliefert. [PROPS: p5_sme_actionable_rpa_agents_research_km, p2_uncertainty_no_hallucination, p1_context_discipline]",
    "User: gib 10 iso standards, aber ich schreib nur: iso wichtig Assistant: Beispielhafte ISO Standards: ISO 9001, ISO 14001, ISO 27001, ISO 45001, ISO 20000-1, ISO 22301, ISO 50001, ISO 13485, ISO 31000, ISO 8601. [PROPS: p2_uncertainty_no_hallucination, p3_multiformat_same_semantics]",
    "User: iso 8601 was ist das, 1 satz Assistant: ISO 8601 definiert ein standardisiertes Datums und Zeitformat (z. B. 2026-02-14), das Interoperabilitaet in IT Systemen sicherstellt. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich brauche datum heute im iso format, ohne text Assistant: 2026-02-14 [PROPS: p3_multiformat_same_semantics]",
    "User: rpa log: gib iso datetime mit uhrzeit, 24h Assistant: 2026-02-14T20:14:14 [PROPS: p3_multiformat_same_semantics, p5_sme_actionable_rpa_agents_research_km]",
    "User: warum ist iso zeit wichtig fuer agents? Assistant: Einheitliche Zeitformate reduzieren Parsing Fehler, ermoeglichen eindeutige Sortierung und vereinfachen Audit Trails, wodurch Agentenketten und RPA Workflows reproduzierbar werden. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: mach 10 projektmgmt begriffe, aber ich tippe nur: pm basics Assistant: Scope, Meilenstein, Gantt Plan, Critical Path, Risiko, Stakeholder, Change Request, Backlog, Sprint, Retrospektive. [PROPS: p3_multiformat_same_semantics]",
    "User: sprint in klassischem pm? passt das? Assistant: Der Begriff stammt primär aus agilen Methoden; in klassischem PM gibt es aehnliche Zeitbox Konzepte, daher sollte das Projektvorgehensmodell als Konvention benannt werden, um Terminologie konsistent zu halten. [PROPS: p1_context_discipline, p4_cross_domain_transfer]",
    "User: gib 10 scrum rollen, aber nur core, keine extras Assistant: In Scrum sind die Kernrollen: Product Owner, Scrum Master, Developers; erweiterte Rollenbegriffe wie Stakeholder oder Sponsor sind kontextabhaengig und nicht Teil der Kernrollen. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination]",
    "User: ich will trotzdem 10 rollen wie in firmen, aber markier scrum core Assistant: Scrum core: Product Owner, Scrum Master, Developer. Unternehmensrollen zusaetzlich (beispielhaft): Stakeholder, Sponsor, Agile Coach, Release Manager, QA, UX, Projektleitung. [PROPS: p1_context_discipline, p2_uncertainty_no_hallucination, p5_sme_actionable_rpa_agents_research_km]",
    "User: gib 10 medizin begriffe, aber ich tippe nur: med worte Assistant: Diagnose, Therapie, Prognose, Symptom, Aetiologie, Pathogenese, Anamnese, Screening, Komorbiditaet, Nebenwirkung. [PROPS: p3_multiformat_same_semantics]",
    "User: aetiologie vs pathogenese, kurz Assistant: Aetiologie beschreibt die Ursache einer Erkrankung, Pathogenese beschreibt den Entstehungs und Entwicklungsprozess der Erkrankung. [PROPS: p3_multiformat_same_semantics]",
    "User: warum ist das relevant fuer km? Assistant: Praezise Begriffsdifferenzierung reduziert Wissensverwechslungen, verbessert Suchbarkeit und erhoeht die Qualitaet von Entscheidungsgrundlagen, was im Wissensmanagement direkt auf Fehlerkosten wirkt. [PROPS: p4_cross_domain_transfer, p5_sme_actionable_rpa_agents_research_km]",
    "User: ich brauche 10 rechts begriffe, aber ich schreib nur: jur basics Assistant: Vertrag, Delikt, Haftung, Eigentum, Besitz, Rechtsfaehigkeit, Willenserklaerung, Verjaehrung, Prozess, Urteil. [PROPS: p3_multiformat_same_semantics]",
    "User: vertrag vs willenserklaerung, 1 satz Assistant: Eine Willenserklaerung ist eine einzelne rechtliche Erklaerung, waehrend ein Vertrag typischerweise aus mindestens zwei korrespondierenden Willenserklaerungen (Angebot und Annahme) besteht. [PROPS: p3_multiformat_same_semantics]",
    "User: gib 10 kpi begriffe, aber ich tippe nur: kpis Assistant: Umsatz, Bruttomarge, EBIT, EBITDA, Nettogewinn, Cashflow, Working Capital, Eigenkapitalquote, ROI, ROE. [PROPS: p3_multiformat_same_semantics]",
    "User: ebit vs ebitda, kurz, ohne umstaende Assistant: EBIT ist Ergebnis vor Zinsen und Steuern, EBITDA ist Ergebnis vor Zinsen, Steuern und Abschreibungen; die Wahl ist eine Reporting Konvention und beeinflusst Vergleichbarkeit. [PROPS: p4_cross_domain_transfer, p1_context_discipline]",
    "User: mach agent regel: kpi definition immer mit scope Assistant: Regel: Jede KPI wird mit Formel, Zeitraum, Datenquelle, Abgrenzung (Scope) und Rundungsregel dokumentiert; ohne diese Angaben wird eine Rueckfrage gestellt, um Fehlinterpretationen in Reports und Automationen zu vermeiden. [PROPS: p5_sme_actionable_rpa_agents_research_km, p1_context_discipline, p2_uncertainty_no_hallucination]"
]