[
    "User: Nenne die 10 hoechsten Berge der Erde als Liste. Assistant: Hier ist eine Liste der 10 hoechsten Berge (nach Hoehe ueber Meeresspiegel, ungefaehr): 1) Mount Everest 8848.86 m 2) K2 8611 m 3) Kangchenjunga 8586 m 4) Lhotse 8516 m 5) Makalu 8485 m 6) Cho Oyu 8188 m 7) Dhaulagiri I 8167 m 8) Manaslu 8163 m 9) Nanga Parbat 8126 m 10) Annapurna I 8091 m.",
    "User: Nenne die 10 laengsten Fluesse der Erde als Liste. Assistant: Hier ist eine Liste haeufig genannter Kandidaten fuer die 10 laengsten Fluesse (Rangfolgen variieren je nach Messmethode): 1) Nil 2) Amazonas 3) Jangtse 4) Mississippi Missouri 5) Jenissei Angara Selenga 6) Gelber Fluss (Huang He) 7) Ob Irtysch 8) Kongo 9) Amur Argun 10) Lena.",
    "User: Nenne die Planeten im Sonnensystem in der richtigen Reihenfolge. Assistant: Die Planeten im Sonnensystem (von innen nach aussen) sind: Merkur, Venus, Erde, Mars, Jupiter, Saturn, Uranus, Neptun.",
    "User: Nenne die 10 groessten Laender nach Flaeche. Assistant: Liste der 10 groessten Laender nach Flaeche (ungefaehr): 1) Russland 2) Kanada 3) USA 4) China 5) Brasilien 6) Australien 7) Indien 8) Argentinien 9) Kasachstan 10) Algerien.",
    "User: Nenne die 10 bevoelkerungsreichsten Laender. Assistant: Liste der 10 bevoelkerungsreichsten Laender (Rangfolgen variieren je nach Jahr): 1) Indien 2) China 3) USA 4) Indonesien 5) Pakistan 6) Nigeria 7) Brasilien 8) Bangladesch 9) Russland 10) Mexiko.",
    "User: Nenne die 7 Kontinente als Liste. Assistant: Liste der Kontinente: Afrika, Antarktika, Asien, Europa, Nordamerika, Ozeanien, Suedamerika.",
    "User: Nenne die 5 Ozeane der Erde. Assistant: Liste der Ozeane: Pazifischer Ozean, Atlantischer Ozean, Indischer Ozean, Arktischer Ozean, Suedlicher Ozean.",
    "User: Nenne die 10 groessten Inseln der Erde. Assistant: Liste der 10 groessten Inseln (ungefaehr): 1) Groenland 2) Neuguinea 3) Borneo 4) Madagaskar 5) Baffin Island 6) Sumatra 7) Honshu 8) Victoria Island 9) Great Britain 10) Ellesmere Island.",
    "User: Nenne die 10 groessten Seen der Erde nach Flaeche. Assistant: Liste der groessten Seen nach Flaeche (ungefaehr): 1) Kaspisches Meer 2) Oberer See 3) Viktoriasee 4) Huronsee 5) Michigansee 6) Tanganjikasee 7) Baikalsee 8) Grosser Baerensee 9) Malawisee 10) Grosser Sklavensee.",
    "User: Nenne die 10 tiefsten Seen der Erde. Assistant: Liste der tiefsten Seen (ungefaehr): 1) Baikalsee 2) Tanganjikasee 3) Kaspisches Meer 4) Wostoksee 5) O Higgins San Martin 6) Malawisee 7) Issyk Kul 8) Grosser Sklavensee 9) Crater Lake 10) Matano.",
    "User: Nenne die 10 laengsten Gebirgszuege der Erde. Assistant: Liste der laengsten Gebirgszuege (geographische Definitionen variieren): 1) Anden 2) Rocky Mountains 3) Himalaya Karakorum System (als Gebirgsbogen) 4) Great Dividing Range 5) Transantarktisches Gebirge 6) Ural 7) Atlas 8) Appalachen 9) Alpen Karpaten Bogen (als System) 10) Drakensberge.",
    "User: Nenne die 10 hoechsten Wasserfaelle der Welt. Assistant: Liste der hoechsten Wasserfaelle (ungefaehr, Messunsicherheiten moeglich): 1) Angel Falls 2) Tugela Falls 3) Tres Hermanas Falls 4) Olo upena Falls 5) Yumbilla Falls 6) Vinnufossen 7) Balai Falls 8) Puukaoku Falls 9) James Bruce Falls 10) Brown Falls.",
    "User: Nenne die 10 groessten Staedte nach Einwohnerzahl im Ballungsraum. Assistant: Liste haeufig genannter Ballungsraeume (Definitionen variieren): 1) Tokio 2) Delhi 3) Shanghai 4) Sao Paulo 5) Mexiko Stadt 6) Kairo 7) Dhaka 8) Mumbai 9) Beijing 10) Osaka.",
    "User: Nenne die 10 wichtigsten Zeitzonen Abkuerzungen. Assistant: Liste gaengiger Zeitzonenabkuerzungen: UTC, GMT, CET, CEST, EET, EST, EDT, PST, PDT, JST.",
    "User: Nenne die 10 haeufigsten chemischen Elemente in der Erdkruste. Assistant: Liste (ungefaehr, nach Massenanteil): Sauerstoff, Silizium, Aluminium, Eisen, Calcium, Natrium, Kalium, Magnesium, Titan, Wasserstoff.",
    "User: Nenne die 10 haeufigsten chemischen Elemente im Universum. Assistant: Liste (ungefaehr): Wasserstoff, Helium, Sauerstoff, Kohlenstoff, Neon, Eisen, Stickstoff, Silizium, Magnesium, Schwefel.",
    "User: Nenne die 10 groessten Planeten und Zwergplaneten im Sonnensystem nach Durchmesser. Assistant: Liste (grobe Reihenfolge): Jupiter, Saturn, Uranus, Neptun, Erde, Venus, Mars, Merkur, Pluto, Eris.",
    "User: Nenne die 10 groessten Monde im Sonnensystem nach Durchmesser. Assistant: Liste (ungefaehr): Ganymed, Titan, Kallisto, Io, Mond, Europa, Triton, Titania, Rhea, Oberon.",
    "User: Nenne die 10 hellsten Sterne am Nachthimmel. Assistant: Liste (scheinbare Helligkeit, ungefaehr): Sirius, Canopus, Arcturus, Alpha Centauri, Vega, Capella, Rigel, Procyon, Achernar, Betelgeuse.",
    "User: Nenne die 12 Tierkreiszeichen als Liste. Assistant: Liste: Widder, Stier, Zwillinge, Krebs, Loewe, Jungfrau, Waage, Skorpion, Schuetze, Steinbock, Wassermann, Fische.",
    "User: Nenne die 7 SI Basiseinheiten. Assistant: Liste: Meter, Kilogramm, Sekunde, Ampere, Kelvin, Mol, Candela.",
    "User: Nenne die 10 wichtigsten SI Vorsilben von kilo bis pico. Assistant: Liste: kilo (10^3), mega (10^6), giga (10^9), tera (10^12), milli (10^-3), mikro (10^-6), nano (10^-9), pico (10^-12), femto (10^-15), atto (10^-18).",
    "User: Nenne die 10 haeufigsten Programmiersprachen (Beispiele) als Liste. Assistant: Liste (Beispiele, je nach Index): Python, JavaScript, Java, C, C++, C#, Go, TypeScript, PHP, Rust.",
    "User: Nenne die 10 wichtigsten HTTP Statuscodes. Assistant: Liste: 200 OK, 201 Created, 204 No Content, 301 Moved Permanently, 302 Found, 304 Not Modified, 400 Bad Request, 401 Unauthorized, 403 Forbidden, 404 Not Found.",
    "User: Nenne die 10 gaengigen Kryptographie Begriffe als Liste. Assistant: Liste: Hashfunktion, Salt, Key Derivation, Symmetrische Verschluesselung, Asymmetrische Verschluesselung, Public Key, Private Key, Digitale Signatur, Zertifikat, TLS.",
    "User: Nenne die 10 wichtigsten Linux Befehle (Grundlagen). Assistant: Liste: ls, cd, pwd, cp, mv, rm, mkdir, cat, grep, chmod.",
    "User: Nenne die 10 wichtigsten Git Befehle. Assistant: Liste: git init, git clone, git status, git add, git commit, git push, git pull, git branch, git checkout, git merge.",
    "User: Nenne die 10 wichtigsten SQL Konzepte als Liste. Assistant: Liste: Tabellen, Primaerschluessel, Fremdschluessel, Joins, Indizes, Normalisierung, Transaktionen, ACID, Views, Constraints.",
    "User: Nenne die 10 gaengigen Datenstrukturen. Assistant: Liste: Array, Linked List, Stack, Queue, Hash Map, Tree, Binary Search Tree, Heap, Graph, Trie.",
    "User: Nenne die 10 gaengigen Sortierverfahren. Assistant: Liste: Quicksort, Mergesort, Heapsort, Timsort, Insertion Sort, Selection Sort, Bubble Sort, Counting Sort, Radix Sort, Shellsort.",
    "User: Nenne die 10 Prinzipien der sicheren Softwareentwicklung. Assistant: Liste: Input Validation, Least Privilege, Secure Defaults, Defense in Depth, Fail Securely, Logging and Monitoring, Threat Modeling, Secrets Management, Dependency Management, Security Testing.",
    "User: Nenne die 10 gaengigen Cloud Service Modelle und Begriffe. Assistant: Liste: IaaS, PaaS, SaaS, FaaS, Containers, Kubernetes, Serverless, VPC, IAM, Observability.",
    "User: Nenne die 10 gaengigen Machine Learning Modellklassen. Assistant: Liste: Lineare Regression, Logistische Regression, Entscheidungsbaeume, Random Forest, Gradient Boosting, SVM, K Means, Neuronale Netze, Naive Bayes, PCA.",
    "User: Nenne die 10 Metriken zur Modellbewertung (Klassifikation) als Liste. Assistant: Liste: Accuracy, Precision, Recall, F1 Score, ROC AUC, PR AUC, Log Loss, Matthews Correlation, Balanced Accuracy, Confusion Matrix.",
    "User: Nenne die 10 wichtigsten Konzepte der Statistik. Assistant: Liste: Stichprobe, Grundgesamtheit, Erwartungswert, Varianz, Standardabweichung, Konfidenzintervall, Hypothesentest, p Wert, Korrelation, Regression.",
    "User: Nenne die 10 groessten Religionen oder Glaubensgemeinschaften (Beispiele) als Liste. Assistant: Liste (Beispiele, Abgrenzung variiert): Christentum, Islam, Hinduismus, Buddhismus, Sikhismus, Judentum, Bahai, Jainismus, Shinto, Daoismus.",
    "User: Nenne die 10 groessten Aktienindizes (Beispiele). Assistant: Liste (Beispiele): S and P 500, Dow Jones Industrial Average, Nasdaq 100, DAX, FTSE 100, CAC 40, Nikkei 225, Hang Seng, STOXX Europe 600, MSCI World.",
    "User: Nenne die 10 wichtigsten Kennzahlen im Rechnungswesen. Assistant: Liste: Umsatz, Bruttomarge, EBIT, EBITDA, Nettogewinn, Cashflow, Working Capital, Eigenkapitalquote, ROI, ROE.",
    "User: Nenne die 10 wichtigsten Projektmanagement Begriffe. Assistant: Liste: Scope, Meilenstein, Gantt Plan, Critical Path, Risiko, Stakeholder, Change Request, Backlog, Sprint, Retrospektive.",
    "User: Nenne die 10 wichtigsten Rollen in Scrum. Assistant: Liste: Product Owner, Scrum Master, Developer, Stakeholder, User, Sponsor, Agile Coach, Release Manager, QA, UX.",
    "User: Nenne die 10 wichtigsten ISO Standards (Beispiele). Assistant: Liste (Beispiele): ISO 9001, ISO 14001, ISO 27001, ISO 45001, ISO 20000 1, ISO 22301, ISO 50001, ISO 13485, ISO 31000, ISO 8601.",
    "User: Nenne die 10 wichtigsten Datenschutz Begriffe. Assistant: Liste: Personenbezogene Daten, Verarbeitung, Einwilligung, Zweckbindung, Datenminimierung, Auftragsverarbeitung, Betroffenenrechte, Data Breach, Pseudonymisierung, Anonymisierung.",
    "User: Nenne die 10 groessten Volkswirtschaften nach nominalem BIP (Beispiele). Assistant: Liste (Beispiele, je nach Jahr): USA, China, Deutschland, Japan, Indien, Vereinigtes Koenigreich, Frankreich, Italien, Kanada, Brasilien.",
    "User: Nenne die 10 wichtigsten Rohstoffe im Welthandel (Beispiele). Assistant: Liste (Beispiele): Rohöl, Erdgas, Kohle, Eisen, Kupfer, Aluminium, Gold, Weizen, Sojabohnen, Kaffee.",
    "User: Nenne die 10 wichtigsten erneuerbaren Energiequellen oder Technologien. Assistant: Liste: Photovoltaik, Windenergie Onshore, Windenergie Offshore, Wasserkraft, Biomasse, Geothermie, Solarthermie, Waermepumpen, Power to X, Batteriespeicher.",
    "User: Nenne die 10 wichtigsten Teile eines Computers. Assistant: Liste: CPU, GPU, RAM, Mainboard, SSD, Netzteil, Kuehlung, Gehaeuse, Netzwerkadapter, Peripherie Schnittstellen.",
    "User: Nenne die 10 wichtigsten Dateiformate fuer Dokumente und Daten. Assistant: Liste: TXT, CSV, JSON, XML, PDF, DOCX, XLSX, PPTX, HTML, Markdown.",
    "User: Nenne die 10 wichtigsten Begriffe der Informationstheorie. Assistant: Liste: Entropie, Redundanz, Kanal, Rauschen, Codierung, Bitrate, Mutual Information, Kompression, Fehlerkorrektur, Kapazitaet.",
    "User: Nenne die 10 wichtigsten Begriffe der Systemtheorie. Assistant: Liste: System, Grenze, Rueckkopplung, Stabilitaet, Dynamik, Emergenz, Nichtlinearitaet, Steuerung, Regelung, Komplexitaet.",
    "User: Nenne die 10 wichtigsten Begriffe der Ethik in der Technik. Assistant: Liste: Verantwortung, Transparenz, Fairness, Nicht Schaeden, Autonomie, Gerechtigkeit, Rechenschaft, Privacy, Sicherheit, Nachhaltigkeit.",
    "User: Nenne die 10 wichtigsten Konzepte der Qualitaetssicherung. Assistant: Liste: Testfall, Testabdeckung, Unit Test, Integrationstest, Systemtest, Regressionstest, Code Review, Static Analysis, Monitoring, Incident Management.",
    "User: Nenne die 10 gaengigen Kommunikationsprotokolle. Assistant: Liste: TCP, UDP, IP, HTTP, HTTPS, DNS, SMTP, IMAP, SSH, TLS.",
    "User: Nenne die 10 wichtigsten Begriffe der Kryptooekonomie (Beispiele). Assistant: Liste (Beispiele): Blockchain, Konsens, Proof of Work, Proof of Stake, Wallet, Private Key, Smart Contract, Token, Gas Fee, Layer 2.",
    "User: Nenne die 10 wichtigsten Begriffe des Marketings. Assistant: Liste: Zielgruppe, Positionierung, USP, Conversion, Funnel, CAC, LTV, Brand, Kampagne, Segmentierung.",
    "User: Nenne die 10 wichtigsten Begriffe der Logistik. Assistant: Liste: Supply Chain, Lagerhaltung, Kommissionierung, Lead Time, Transport, Umschlag, Tracking, Incoterms, Bestandsmanagement, Routenoptimierung.",
    "User: Nenne die 10 wichtigsten Begriffe der Produktion. Assistant: Liste: Stueckliste, Durchlaufzeit, OEE, Taktzeit, Ruestzeit, Ausschuss, Kaizen, Just in Time, Kanban, Six Sigma.",
    "User: Nenne die 10 wichtigsten Begriffe der Medizin (allgemein) als Liste. Assistant: Liste: Diagnose, Therapie, Prognose, Symptom, Aetiologie, Pathogenese, Anamnese, Screening, Komorbiditaet, Nebenwirkung.",
    "User: Nenne die 10 wichtigsten Impfstoffe oder Impfstoffarten (Beispiele). Assistant: Liste (Beispiele): mRNA, Vektor, Protein Subunit, Inaktiviert, Lebend attenuiert, Toxoid, Konjugat, Virus like Particle, DNA, Nasal.",
    "User: Nenne die 10 wichtigsten Begriffe der Rechtswissenschaft (allgemein). Assistant: Liste: Vertrag, Delikt, Haftung, Eigentum, Besitz, Rechtsfaehigkeit, Willenserklaerung, Verjaehrung, Prozess, Urteil.",
    "User: Nenne die 10 wichtigsten Begriffe der Volkswirtschaftslehre. Assistant: Liste: Angebot, Nachfrage, Inflation, Arbeitslosigkeit, BIP, Produktivitaet, Geldpolitik, Fiskalpolitik, Wechselkurs, Konjunktur.",
    "User: Nenne die 10 wichtigsten Begriffe der Psychologie (allgemein). Assistant: Liste: Kognition, Emotion, Motivation, Lernen, Gedis, Aufmerksamkeit, Verhalten, Persoenlichkeit, Stress, Resilienz.",
    "User: Nenne die 10 wichtigsten Begriffe der Paedagogik (allgemein). Assistant: Liste: Didaktik, Methodik, Curriculum, Kompetenz, Evaluation, Inklusion, Differenzierung, Lernziel, Feedback, Motivation.",
    "User: Nenne die 10 wichtigsten Begriffe der Linguistik (allgemein). Assistant: Liste: Phonetik, Phonologie, Morphologie, Syntax, Semantik, Pragmatik, Graphem, Korpus, Dialekt, Soziolekt.",
    "User: Nenne die 10 wichtigsten Begriffe der Philosophie (allgemein). Assistant: Liste: Ontologie, Epistemologie, Ethik, Logik, Metaphysik, Aesthetik, Hermeneutik, Determinismus, Skeptizismus, Utilitarismus.",
    "User: Nenne die 10 wichtigsten Begriffe der Soziologie (allgemein). Assistant: Liste: Struktur, Institution, Norm, Rolle, Sozialisation, Ungleichheit, Macht, Kultur, Netzwerk, Modernisierung.",
    "User: Nenne die 10 wichtigsten Begriffe der Politikwissenschaft (allgemein). Assistant: Liste: Staat, Regierung, Parlament, Demokratie, Gewaltenteilung, Souveraenitaet, Partei, Wahl, Lobbyismus, Policy.",
    "User: Nenne die 10 wichtigsten Begriffe der Betriebswirtschaft (allgemein). Assistant: Liste: Bilanz, GuV, Kostenrechnung, Deckungsbeitrag, Liquiditaet, Budget, Forecast, Controlling, Portfolio, Strategie.",
    "User: Nenne die 10 wichtigsten Begriffe der Chemie (allgemein). Assistant: Liste: Atom, Molekuel, Bindung, Reaktion, Katalysator, Mol, Konzentration, pH, Oxidation, Reduktion."
  ]